reading-notes/functional-programming/pointfree.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2022-03-13 Sun 10:20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Functions</a></li>
<li><a href="#sec-2">2. Side effects</a></li>
<li><a href="#sec-3">3. Algebraic data types</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Higher order functions</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Functional setters</a>
<ul class="nav">
<li><a href="#sec-5-1">5.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Setters and key paths</a>
<ul class="nav">
<li><a href="#sec-6-1">6.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Getters and key paths</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Algebraic Data Types: Exponents</a>
<ul class="nav">
<li><a href="#sec-8-1">8.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-9">9. A tale of two flat maps</a>
<ul class="nav">
<li><a href="#sec-9-1">9.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Composition without operators</a>
<ul class="nav">
<li><a href="#sec-10-1">10.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Tagged</a>
<ul class="nav">
<li><a href="#sec-11-1">11.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Dependency Injection made easy</a>
<ul class="nav">
<li><a href="#sec-12-1">12.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Dependency Injection Made Comfortable</a>
<ul class="nav">
<li><a href="#sec-13-1">13.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Playground Driven Development</a></li>
<li><a href="#sec-15">15. Dependency Injection Made Composable</a></li>
<li><a href="#sec-16">16. A Tour of the Composable Architecture: Part 1</a></li>
<li><a href="#sec-17">17. A Tour of the Composable Architecture: Part 2</a></li>
<li><a href="#sec-18">18. A Tour of the Composable Architecture: Part 3</a></li>
<li><a href="#sec-19">19. A Tour of the Composable Architecture: Part 4</a></li>
<li><a href="#sec-20">20. Designing Dependenciecs: The problem</a></li>
<li><a href="#sec-21">21. Designing Dependencies: Modularization</a></li>
<li><a href="#sec-22">22. Designing Dependencies: Reachability</a></li>
<li><a href="#sec-23">23. Designing Dependencies: Core Location</a></li>
<li><a href="#sec-24">24. Designing Dependencies: The point</a></li>
<li><a href="#sec-25">25. Redacted SwiftUI: The problem</a></li>
<li><a href="#sec-26">26. Redacted SwiftUI: The Composable Architecture</a></li>
<li><a href="#sec-27">27. The Point of Redacted SwiftUI: Part 1</a>
<ul class="nav">
<li><a href="#sec-27-1">27.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-28">28. The Point of Redacted SwiftUI: Part 2</a></li>
<li><a href="#sec-29">29. Concise Forms: SwiftUI</a></li>
<li><a href="#sec-30">30. Concise Forms: Composable Architecture</a>
<ul class="nav">
<li><a href="#sec-30-1">30.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-31">31. Concise Forms: Bye Bye Boilerplate</a>
<ul class="nav">
<li><a href="#sec-31-1">31.1. Exercises:</a></li>
</ul>
</li>
<li><a href="#sec-32">32. Concise Forms: The Point</a></li>
<li><a href="#sec-33">33. SwiftUI Animation: The Basics</a>
<ul class="nav">
<li><a href="#sec-33-1">33.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-34">34. Better Test Dependencies: Exhaustivity</a>
<ul class="nav">
<li><a href="#sec-34-1">34.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-35">35. Better Test Dependencies: Failability</a></li>
<li><a href="#sec-36">36. A Tour of Isowords: Part 1</a></li>
<li><a href="#sec-37">37. A Tour of Isowords: Part 2</a></li>
<li><a href="#sec-38">38. Async Refreshable: SwiftUI</a></li>
<li><a href="#sec-39">39. Async Refreshable: ComposableArchitecture</a>
<ul class="nav">
<li><a href="#sec-39-1">39.1. Exercises</a></li>
</ul>
</li>
<li><a href="#sec-40">40. Safer, Conciser Forms: Part 1</a></li>
<li><a href="#sec-41">41. Safer, Conciser Forms: Part 2</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<p>
key takeaways for <a href="https://www.pointfree.co/">https://www.pointfree.co/</a>
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Functions</h2>
<div class="outline-text-2" id="text-1">
<p>
Introduces operator <code>|&gt;</code> (forward application) and <code>&gt;&gt;&gt;</code> (forward composition).
</p>
<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #a45bad;">2</span> |&gt; incr <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">== incr(2)</span>
  <span style="color: #4f97d7;">(</span>incr &gt;&gt;&gt; square<span style="color: #4f97d7;">)(</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">9</span>
</pre>
</div>
<ul class="org-ul">
<li>Forward composition is the oposite of haskells <code>.</code> composition operator (<code>(b-&gt;c)-&gt;(a-&gt;b)-&gt;(a-&gt;c)</code>)
</li>
<li>Use precedencegroups to avoid writing brackets
</li>
<li>Use operators with care.
</li>
<li>Tooling suffers from Free functions + operators (no autocomplete)
</li>
<li>Methods don't compose as well, because they have to be associated with a value all the time
</li>
<li>Pointfree: never refer to the value you are processing, focus on functions and compositions
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Side effects</h2>
<div class="outline-text-2" id="text-2">
<p>
Side effects break composability, eg <code>map $ map f</code> can have
different side effects than <code>map (f . f)</code>, but the same return value.
</p>

<p>
Take for example writing logs.
We can fix the problem of returning logs alongside the computation (<code>(_ x: Int) -&gt; (Int, [String])</code>).
But for this kind of function/operator we need a new <code>compose</code> function that appends the logs from both function executions.
</p>

<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #4f97d7; font-weight: bold;">func</span> &gt;=&gt; &lt;A, B, C&gt;<span style="color: #4f97d7;">(</span>
    _ f: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span> -&gt; B?,
    _ g: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>B<span style="color: #bc6ec5;">)</span> -&gt; C?
    <span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span> -&gt; C?<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">{</span> a <span style="color: #4f97d7; font-weight: bold;">in</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">same for lists and optionals:</span>
        <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #2d9574;">(</span>a<span style="color: #2d9574;">)</span>.<span style="color: #4f97d7;">flatMap</span><span style="color: #2d9574;">(</span>g<span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
In haskell, it has type <code>(&gt;=&gt;) :: Monad m =&gt; (a -&gt; m b) -&gt; (b -&gt; m c) -&gt; a -&gt; m c</code>,
forward composition for monadic functions.
</p>

<p>
We can avoid having inputs from side effects with currying.
<code>&lt;&gt;</code> is then defined as function composition for functions that return the input type.
(In haskell this is more generally defined on semigroups, namely: <code>(&lt;&gt;) :: Semigroup a =&gt; a -&gt; a -&gt; a</code>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Algebraic data types</h2>
<div class="outline-text-2" id="text-3">
<p>
Composite types can also be called <i>algebraic data types</i>, because we can do algebra with them.
E.g. if an enum has cases for type A and B we can construct \(A + B\) values from it, where in this notation,
\(A\) and \(B\) denote the number of values that can be constructed in the respective type. For pairs that's \(A * B\).
<code>Void</code> has 1 value and <code>Never</code> 0.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Exercises</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Exponential. So for \(A->B\), it has \(B^A\) types. Because we choose a value from set \(B\) \(A\) times.
</li>
<li><code>List&lt;A&gt; = 1 + A * List&lt;A&gt;</code>
</li>
<li><code>Optional&lt;Either&lt;A, B&gt;&gt; = 1 + A + B</code>
<code>!= (A + 1) + (B + 1) = Either&lt;Optional&lt;A&gt;, Optional&lt;B&gt;&gt;</code>.
In the second type there is <code>Left nil</code> and <code>Right nil</code> whereas in the first there is just <code>nil</code> for the absence of values.
</li>
<li><code>Either&lt;Optional&lt;A&gt;, B&gt; = 1+A+B = Optional&lt;Either&lt;A, B&gt;&gt;</code>. They are equivalent.
</li>
<li>Using the previous definitions for Pair and Either:
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">func</span> * &lt;A, B&gt;<span style="color: #4f97d7;">(</span>lhs: A.<span style="color: #4f97d7; font-weight: bold;">Type</span>, rhs: B.<span style="color: #4f97d7; font-weight: bold;">Type</span><span style="color: #4f97d7;">)</span> -&gt; Pair&lt;A, B&gt;.<span style="color: #4f97d7; font-weight: bold;">Type</span> <span style="color: #4f97d7;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span> Pair&lt;A, B&gt;.<span style="color: #4f97d7; font-weight: bold;">self</span>
        <span style="color: #4f97d7;">}</span>
        
        <span style="color: #4f97d7; font-weight: bold;">func</span> + &lt;A, B&gt;<span style="color: #4f97d7;">(</span>lhs: A.<span style="color: #4f97d7; font-weight: bold;">Type</span>, rhs: B.<span style="color: #4f97d7; font-weight: bold;">Type</span><span style="color: #4f97d7;">)</span> -&gt; Either&lt;A, B&gt;.<span style="color: #4f97d7; font-weight: bold;">Type</span> <span style="color: #4f97d7;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span> Either&lt;A, B&gt;.<span style="color: #4f97d7; font-weight: bold;">self</span>
        <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
