org/reading-notes/functional-programming/pointfree.org
* Functional setters
If you modify data structures (by returning a copy), you will end up repeating a lot of code for transforming just one value.
Solution: Define generic functions for applying a function on a property.
This reduces boilerplate especially when types are modified, because you need a new copy everytime the type changes.
#+BEGIN_SRC swift
pair
  |> first(incr)
  |> first(String.init)
  |> second(zurry(flip(String.uppercased)))
// ("43", "SWIFT")
#+END_SRC
To compose functions within setters, we need to take care that it is done in the correct order.
E.g.
#+BEGIN_SRC swift
  let nested = ((1, true), "Swift")
  nested
  |> (second >>> first) { !$0 }
// ((1, false), "Swift")
#+END_SRC
Setter composition /composes backwards/.
Setters /lift/ a transformation on an individual value into a function operating
on the surrounding datatype.
