reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Functional setters</h2>
<div class="outline-text-2" id="text-5">
<p>
If you modify data structures (by returning a copy), you will end up repeating a lot of code for transforming just one value.
Solution: Define generic functions for applying a function on a property.
This reduces boilerplate especially when types are modified, because you need a new copy everytime the type changes.
</p>
<div class="org-src-container">

<pre class="src src-swift">pair
  |&gt; <span style="color: #bc6ec5; font-weight: bold;">first</span><span style="color: #4f97d7;">(</span>incr<span style="color: #4f97d7;">)</span>
  |&gt; <span style="color: #bc6ec5; font-weight: bold;">first</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">String</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #4f97d7;">)</span>
  |&gt; <span style="color: #bc6ec5; font-weight: bold;">second</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">zurry</span><span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">flip</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7;">String</span>.<span style="color: #4f97d7;">uppercased</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">("43", "SWIFT")</span>
</pre>
</div>
<p>
To compose functions within setters, we need to take care that it is done in the correct order.
E.g.
</p>
<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #4f97d7; font-weight: bold;">let</span> nested = <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">true</span><span style="color: #bc6ec5;">)</span>, <span style="color: #2d9574;">"Swift"</span><span style="color: #4f97d7;">)</span>
  nested
  |&gt; <span style="color: #4f97d7;">(</span>second &gt;&gt;&gt; first<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">!</span>$0 <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">((1, false), "Swift")</span>
</pre>
</div>
<p>
Setter composition <i>composes backwards</i>.
Setters <i>lift</i> a transformation on an individual value into a function operating
on the surrounding datatype.
</p>
</div>
