reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Setters and key paths</h2>
<div class="outline-text-2" id="text-6">
<p>
Key paths are generic over type they apply to, and the specific value, eg.
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7;">KeyPath</span>&lt;User, <span style="color: #4f97d7;">String</span>&gt;
</pre>
</div>
<p>
you can use a keypath with array syntax!
</p>
<div class="org-src-container">

<pre class="src src-swift">user<span style="color: #4f97d7;">[</span>keyPath: \User.<span style="color: #4f97d7;">name</span><span style="color: #4f97d7;">]</span>
</pre>
</div>
<p>
Key paths are compiler generated (generate setters/getters under the hood)
</p>


<p>
Use prop to compose functions over key paths
</p>
<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">prop</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;<span style="color: #4f97d7;">(</span>_ kp: <span style="color: #4f97d7;">WritableKeyPath</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;<span style="color: #4f97d7;">)</span>
    -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">Value</span><span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Value</span><span style="color: #4f97d7;">)</span>
    -&gt; <span style="color: #4f97d7;">(</span>Root<span style="color: #4f97d7;">)</span>
    -&gt; Root
  
  <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #bc6ec5;">(</span>\User.<span style="color: #4f97d7;">name</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span> $0.<span style="color: #4f97d7;">uppercased</span><span style="color: #bc6ec5;">()</span> <span style="color: #4f97d7;">}</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">User -&gt; User</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">composing:</span>
  <span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #4f97d7;">(</span>\User.<span style="color: #7590db;">location</span><span style="color: #4f97d7;">)</span> &lt;&lt;&lt; <span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #4f97d7;">(</span>\Location.<span style="color: #4f97d7;">name</span><span style="color: #4f97d7;">)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">((String) -&gt; String) -&gt; (User) -&gt; User</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Even though that's equivalent to \User.location.name</span>
</pre>
</div>

<p>
<code>prop</code> allows you to write neat date formatters, URLrequest configurations etc.
pointfree in one expression (without computed props/stateful funcs)..
</p>
</div>
