reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Exercises</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>Dictionary’s subscript key path.
<div class="org-src-container">

<pre class="src src-swift">      <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">Value</span>?<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Value</span>?<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Dictionary</span>&lt;<span style="color: #4f97d7;">Key</span>, <span style="color: #4f97d7;">Value</span>&gt; -&gt; <span style="color: #4f97d7;">Dictionary</span>&lt;<span style="color: #4f97d7;">Key</span>, <span style="color: #4f97d7;">Value</span>&gt;
</pre>
</div>
<p>
The difference when piping map is that the optional in the signature vanishes, because we lift the
transformation in it's monadic context (the monad being the maybe monad).
</p>
</li>
<li>Functional setters for sets
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">elem</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>_ a: <span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Set</span>&lt;A&gt;<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Set</span>&lt;A&gt; <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> f <span style="color: #4f97d7; font-weight: bold;">in</span>
                <span style="color: #2d9574;">{</span> <span style="color: #4f97d7; font-weight: bold;">set</span> <span style="color: #4f97d7; font-weight: bold;">in</span>
                    <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #4f97d7; font-weight: bold;">set</span> = <span style="color: #4f97d7; font-weight: bold;">set</span>
                    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #b1951d;">(</span><span style="color: #4f97d7; font-weight: bold;">set</span>.<span style="color: #4f97d7;">contains</span><span style="color: #4f97d7;">(</span>a<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                        <span style="color: #4f97d7; font-weight: bold;">set</span>.<span style="color: #4f97d7;">insert</span><span style="color: #b1951d;">(</span>a<span style="color: #b1951d;">)</span>
                    <span style="color: #67b11d;">}</span>
                    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">set</span>
                <span style="color: #2d9574;">}</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li>Array subscript key path on user
Guess i misunderstood the task
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #4f97d7;">(</span>\User.<span style="color: #7590db;">favoriteFoods</span><span style="color: #4f97d7;">)(</span><span style="color: #bc6ec5;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> $0.<span style="color: #4f97d7;">isEmpty</span> <span style="color: #2d9574;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #67b11d;">[]</span>
            <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #67b11d;">[</span>$0.<span style="color: #4f97d7;">first</span>!.<span style="color: #4f97d7;">uppercased</span><span style="color: #b1951d;">()</span><span style="color: #67b11d;">]</span> + <span style="color: #4f97d7;">Array</span><span style="color: #67b11d;">(</span>$0.<span style="color: #4f97d7;">dropFirst</span><span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>
            <span style="color: #2d9574;">}</span>
        <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
correctAnswer:
</p>
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #bc6ec5;">(</span>\User.<span style="color: #7590db;">favoriteFoods</span><span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>.<span style="color: #4f97d7;">name</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span> $0.<span style="color: #4f97d7;">uppercased</span><span style="color: #bc6ec5;">()</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li>filtering in place
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #bc6ec5;">(</span>\User.<span style="color: #7590db;">favoriteFoods</span><span style="color: #bc6ec5;">)</span> &lt;&lt;&lt; filter<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">(String -&gt; Bool) -&gt; User -&gt; User</span>
</pre>
</div>
</li>
<li>We will use <code>Result&lt;Value, Error&gt;</code> from <code>Foundation</code>.
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">let</span> result = <span style="color: #4f97d7;">Result</span>&lt;<span style="color: #4f97d7;">Int</span>, <span style="color: #4f97d7;">Error</span>&gt;.<span style="color: #4f97d7;">success</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">value</span>&lt;V, E&gt;<span style="color: #4f97d7;">(</span>f: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>V<span style="color: #2d9574;">)</span>-&gt;V<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Result</span>&lt;V, E&gt;<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Result</span>&lt;V, E&gt;<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> res <span style="color: #4f97d7; font-weight: bold;">in</span>
                <span style="color: #4f97d7; font-weight: bold;">switch</span> res <span style="color: #2d9574;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #4f97d7;">failure</span>:
                    <span style="color: #4f97d7; font-weight: bold;">return</span> res
                <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #4f97d7;">success</span><span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> v<span style="color: #67b11d;">)</span>:
                    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">Result</span>&lt;V, E&gt;.<span style="color: #4f97d7;">success</span><span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #b1951d;">(</span>v<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
                <span style="color: #2d9574;">}</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Error defined equivalently for failure case.</span>
</pre>
</div>
<ol class="org-ol">
<li>No, there are no key paths for structs (Case paths from pointfree as an alternative)
</li>
<li>e.g. for prop, the mapper function returns Void, and we simply need to call it, rather than re-assigning.
<div class="org-src-container">

<pre class="src src-swift">         <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">inoutProp</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;<span style="color: #4f97d7;">(</span>_ kp: <span style="color: #4f97d7;">WritableKeyPath</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;<span style="color: #4f97d7;">)</span>
         -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">inout</span> <span style="color: #4f97d7;">Value</span><span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
         -&gt; <span style="color: #4f97d7;">(</span>Root<span style="color: #4f97d7;">)</span>
         -&gt; Root <span style="color: #4f97d7;">{</span>
             <span style="color: #bc6ec5;">{</span> f <span style="color: #4f97d7; font-weight: bold;">in</span>
                 <span style="color: #2d9574;">{</span> root <span style="color: #4f97d7; font-weight: bold;">in</span>
                     <span style="color: #4f97d7; font-weight: bold;">var</span> root = root
                     <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #67b11d;">(</span>&amp;root<span style="color: #b1951d;">[</span>keyPath: kp<span style="color: #b1951d;">]</span><span style="color: #67b11d;">)</span>
                     <span style="color: #4f97d7; font-weight: bold;">return</span> root
                 <span style="color: #2d9574;">}</span>
             <span style="color: #bc6ec5;">}</span>
         <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
