org/reading-notes/functional-programming/pointfree.org
* Algebraic Data Types: Exponents
As we learned in the exercises from "Algebraic Data Types",
there are $B^A$ functions of type $A->B$.
Since $a^b^c = a^(b*c)$, we can derive that
~C->B->A = (B, C) -> A~.
Shows that curry and uncurry are elemental operations.
Since $a^1 = a$, we can derive zurry and unzurry.

What happens with $a^0=1$?
~Never -> A = Void~
We can define absurd in swift!

#+BEGIN_SRC swift
func to<A>(_ f: (Never) -> A) -> Void {
  return ()
}
#+END_SRC
#+BEGIN_SRC swift
func from<A>(_ x: Void) -> (Never) -> A {
  return { never in
    switch never {
    }
  }
}
#+END_SRC
This can actually be useful, eg. in case of ~Result<Int, Never>~.

Remember that ~inout A -> Void~ can be transformed to ~A->A~?
This means that you can refactor ~(A,B) -> A~ into ~(inout A, B) -> Void~,
~(A, inout B) -> C~ to ~(A, B) -> (C, B)~ and such.

We can also see a correspondence between ~throws~ and ~Result<A, Error>~.

There is also the power law $a^(b+c) = a^b * a ^ c$, equivalent to
~Either<B, C> -> A = (B -> A, C -> A)~

💡We can use exponent laws to understand which functions can't and can not be simplified.

