reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Algebraic Data Types: Exponents</h2>
<div class="outline-text-2" id="text-8">
<p>
As we learned in the exercises from "Algebraic Data Types",
there are \(B^A\) functions of type \(A->B\).
Since \(a^b^c = a^(b*c)\), we can derive that
<code>C-&gt;B-&gt;A = (B, C) -&gt; A</code>.
Shows that curry and uncurry are elemental operations.
Since \(a^1 = a\), we can derive zurry and unzurry.
</p>

<p>
What happens with \(a^0=1\)?
<code>Never -&gt; A = Void</code>
We can define absurd in swift!
</p>

<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">to</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>_ f: <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">Never</span><span style="color: #bc6ec5;">)</span> -&gt; A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Void</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">()</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">from</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>_ x: <span style="color: #4f97d7;">Void</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Never</span><span style="color: #4f97d7;">)</span> -&gt; A <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">{</span> never <span style="color: #4f97d7; font-weight: bold;">in</span>
    <span style="color: #4f97d7; font-weight: bold;">switch</span> never <span style="color: #2d9574;">{</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
This can actually be useful, eg. in case of <code>Result&lt;Int, Never&gt;</code>.
</p>

<p>
Remember that <code>inout A -&gt; Void</code> can be transformed to <code>A-&gt;A</code>?
This means that you can refactor <code>(A,B) -&gt; A</code> into <code>(inout A, B) -&gt; Void</code>,
<code>(A, inout B) -&gt; C</code> to <code>(A, B) -&gt; (C, B)</code> and such.
</p>

<p>
We can also see a correspondence between <code>throws</code> and <code>Result&lt;A, Error&gt;</code>.
</p>

<p>
There is also the power law \(a^(b+c) = a^b * a ^ c\), equivalent to
<code>Either&lt;B, C&gt; -&gt; A = (B -&gt; A, C -&gt; A)</code>
</p>

<p>
💡We can use exponent laws to understand which functions can't and can not be simplified.
</p>
</div>
