reading-notes/functional-programming/pointfree.html

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Exercises</h3>
<div class="outline-text-3" id="text-8-1">
<ol class="org-ol">
<li>\(1^a = 1\)
<code>Void &lt;- a = Void</code>
<code>a -&gt; Void = Void</code>
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">to</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>a: A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Void</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Void</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> void <span style="color: #4f97d7; font-weight: bold;">in</span> void <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
        
        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">from</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>void: <span style="color: #4f97d7;">Void</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Void</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> void <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li>Case 1: \(0^a = 0 | a != 0\)
<code>a -&gt; Never = Never</code>
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">from</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>a: A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Never</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Never</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> never <span style="color: #4f97d7; font-weight: bold;">in</span>
                never
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
        
        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">to</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>never: <span style="color: #4f97d7;">Never</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">Never</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> a <span style="color: #4f97d7; font-weight: bold;">in</span>
                never
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
Case 2: \(0^a = undefined | a = 0\)
</p>
</li>
<li>We will know in the next "Algebraic data types" episode 😌
</li>
<li><code>2^A = Set&lt;A&gt;</code>
<code>A -&gt; Bool = Set&lt;A&gt;</code>
So we can interpret a set as a function from A to Bool,
that returns true if the element is contained, and false otherwise.
</li>
<li><div class="org-src-container">

<pre class="src src-swift">         <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">intersection</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>a: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>A<span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span>, b: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #4f97d7;">{</span>
             <span style="color: #bc6ec5;">{</span> e <span style="color: #4f97d7; font-weight: bold;">in</span>
                 <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">a</span><span style="color: #2d9574;">(</span>e<span style="color: #2d9574;">)</span> &amp;&amp; <span style="color: #bc6ec5; font-weight: bold;">b</span><span style="color: #2d9574;">(</span>e<span style="color: #2d9574;">)</span>
             <span style="color: #bc6ec5;">}</span>
         <span style="color: #4f97d7;">}</span>
        
         <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">union</span>&lt;A&gt;<span style="color: #4f97d7;">(</span>a: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>A<span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span>, b: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #4f97d7;">{</span>
             <span style="color: #bc6ec5;">{</span> e <span style="color: #4f97d7; font-weight: bold;">in</span>
                 <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">a</span><span style="color: #2d9574;">(</span>e<span style="color: #2d9574;">)</span> || <span style="color: #bc6ec5; font-weight: bold;">b</span><span style="color: #2d9574;">(</span>e<span style="color: #2d9574;">)</span>
             <span style="color: #bc6ec5;">}</span>
         <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li>\((1+V)^K\)
Because we map from the key space to the value space with one additional element <code>nil</code>.
</li>
<li><div class="org-src-container">

<pre class="src src-swift">         <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">to</span>&lt;A, B, C&gt;<span style="color: #4f97d7;">(</span>_ f: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>Either&lt;B, C&gt;<span style="color: #bc6ec5;">)</span> -&gt; A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>B<span style="color: #bc6ec5;">)</span> -&gt; A, <span style="color: #bc6ec5;">(</span>C<span style="color: #bc6ec5;">)</span> -&gt; A<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
             <span style="color: #bc6ec5;">(</span> <span style="color: #2d9574;">{</span> b <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #67b11d;">(</span>.<span style="color: #4f97d7; font-weight: bold;">left</span><span style="color: #b1951d;">(</span>b<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #2d9574;">}</span>
                 ,
               <span style="color: #2d9574;">{</span> c <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #67b11d;">(</span>.<span style="color: #4f97d7; font-weight: bold;">right</span><span style="color: #b1951d;">(</span>c<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #2d9574;">}</span>
             <span style="color: #bc6ec5;">)</span>
         <span style="color: #4f97d7;">}</span>
        
         <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">from</span>&lt;A, B, C&gt;<span style="color: #4f97d7;">(</span>_ f: <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>B<span style="color: #2d9574;">)</span> -&gt; A, <span style="color: #2d9574;">(</span>C<span style="color: #2d9574;">)</span> -&gt; A<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>Either&lt;B, C&gt;<span style="color: #4f97d7;">)</span> -&gt; A <span style="color: #4f97d7;">{</span>
             <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span>bToA, cToA<span style="color: #bc6ec5;">)</span> = f
             <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">{</span> bc <span style="color: #4f97d7; font-weight: bold;">in</span>
                 <span style="color: #4f97d7; font-weight: bold;">switch</span> bc <span style="color: #2d9574;">{</span>
                 <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #4f97d7; font-weight: bold;">left</span><span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> b<span style="color: #67b11d;">)</span>:
                     <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">bToA</span><span style="color: #67b11d;">(</span>b<span style="color: #67b11d;">)</span>
                 <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #4f97d7; font-weight: bold;">right</span><span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> c<span style="color: #67b11d;">)</span>:
                     <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">cToA</span><span style="color: #67b11d;">(</span>c<span style="color: #67b11d;">)</span>
                 <span style="color: #2d9574;">}</span>
             <span style="color: #bc6ec5;">}</span>
         <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li><div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">to</span>&lt;A, B, C&gt;<span style="color: #4f97d7;">(</span>_ f: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>C<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #bc6ec5;">(</span>A, B<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>C<span style="color: #bc6ec5;">)</span> -&gt; A, <span style="color: #bc6ec5;">(</span>C<span style="color: #bc6ec5;">)</span> -&gt; B<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">(</span> <span style="color: #2d9574;">{</span> c <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #67b11d;">(</span>c<span style="color: #67b11d;">)</span>.<span style="color: #a45bad;">0</span> <span style="color: #2d9574;">}</span>
                ,
              <span style="color: #2d9574;">{</span> c <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #67b11d;">(</span>c<span style="color: #67b11d;">)</span>.<span style="color: #a45bad;">1</span> <span style="color: #2d9574;">}</span>
            <span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7;">}</span>
        
                <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">from</span>&lt;A, B, C&gt;<span style="color: #4f97d7;">(</span>_ f: <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>C<span style="color: #2d9574;">)</span> -&gt; A, <span style="color: #2d9574;">(</span>C<span style="color: #2d9574;">)</span> -&gt; B<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>C<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span>A, B<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span>cToA, cToB<span style="color: #bc6ec5;">)</span> = f
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">{</span> c <span style="color: #4f97d7; font-weight: bold;">in</span>
                <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">cToA</span><span style="color: #67b11d;">(</span>c<span style="color: #67b11d;">)</span>, <span style="color: #bc6ec5; font-weight: bold;">cToB</span><span style="color: #67b11d;">(</span>c<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
        
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
