org/reading-notes/functional-programming/pointfree.org
* A tale of two flat maps
  ~flatMap~ is the mondaic bind.
  use ~compactMap~ to filter nil values.
