reading-notes/functional-programming/pointfree.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> A tale of two flat maps</h2>
<div class="outline-text-2" id="text-9">
<p>
<code>flatMap</code> is the mondaic bind.
use <code>compactMap</code> to filter nil values.
</p>
</div>
