org/reading-notes/functional-programming/pointfree.org
* Composition without operators
If operators are not the way to go, you can use named functions.
The problem is that you need an overload for any number of arguments.
This might change in the future for variadic generics.
** Exercises
   1.
      #+BEGIN_SRC swift
          func concat<A: AnyObject>(
              _ fs: ((inout A) -> Void)...
          )
          -> (inout A) -> Void {
              { a in fs.forEach { $0(&a) } }
          }
      #+END_SRC
   2.
      
      #+BEGIN_SRC swift
        func concat<A: AnyObject>(
            _ fs: ((A) -> A)...
        )
        -> (A) -> A {
            { x in
                return reduce(f: { a, f in f(a) })(fs)(x)
            }
        }
     #+END_SRC
   3. 
     #+BEGIN_SRC swift
       func compose<A, B, C>(_ f: @escaping (B)->C, _ g: @escaping(A) -> B) -> ((A) -> C) {
           { a in f(g(a)) }
       }
       
       struct Dog {
           var favoriteFood: DogFood
       }
       
       struct DogFood {
           var name: String
           var scrumptiousness: Int
       }
       
       let doggieBoy: Dog = compose(
         prop(\Dog.favoriteFood),
          prop(\DogFood.scrumptiousness))({$0+1})(
         Dog(favoriteFood: DogFood(name: "nuggers", scrumptiousness: 1999)
       ))
   #+END_SRC

* TODO Tagged
We can use `Decodable` and `Encodable` to and from json.
Sometimes it can be desirable to wrap your datatypes with a custom type,
e.g. use an ~Email~ struct instead of just ~String~.
This can help avoid errors, because the compiler will complain if you pass other fields to
e.g. a ~sendEmail~ function.

Problem: If you have a custom struct, you need to adapt the json structure.
Or implement your custom ~Decodable~ instance.
Or use ~RawRepresentable~ which saves a lot of code.
You will have to tag on an ~Equatable~ though:
#+BEGIN_SRC swift
struct Subscription: Decodable {
  struct Id: Decodable, RawRepresentable, Equatable { let rawValue: Int }

  let id: Id
  let ownerId: Int
}
#+END_SRC
This is really need, but you're gonna repeat the three protocols all over again.
Akin to ~newtype~ in haskell we can use ~Tagged<Tag, Type>~:
#+BEGIN_SRC swift
struct Subscription: Decodable {
  typealias Id = Tagged<Subscription, Int>

  let id: Id
  let ownerId: User.Id
}
#+END_SRC
Tagged uses /Conditional conformance/ to implement ~Equatable~ and ~Decodable~:
#+BEGIN_SRC swift
extension Tagged: Equatable where RawValue: Equatable {
  static func == (lhs: Tagged, rhs: Tagged) -> Bool {
    return lhs.rawValue == rhs.rawValue
  }
}
#+END_SRC
If you have to instantiate ~Tagged~ fields yourself, it makes sense to use
~ExpressibleBy...Literal~ protocols.

