reading-notes/functional-programming/pointfree.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Composition without operators</h2>
<div class="outline-text-2" id="text-10">
<p>
If operators are not the way to go, you can use named functions.
The problem is that you need an overload for any number of arguments.
This might change in the future for variadic generics.
</p>
</div>
<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Exercises</h3>
<div class="outline-text-3" id="text-10-1">
<ol class="org-ol">
<li><div class="org-src-container">

<pre class="src src-swift">          <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">concat</span>&lt;A: <span style="color: #4f97d7;">AnyObject</span>&gt;<span style="color: #4f97d7;">(</span>
              _ fs: <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">inout</span> A<span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Void</span><span style="color: #bc6ec5;">)</span>...
          <span style="color: #4f97d7;">)</span>
          -&gt; <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">inout</span> A<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Void</span> <span style="color: #4f97d7;">{</span>
              <span style="color: #bc6ec5;">{</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> fs.<span style="color: #4f97d7;">forEach</span> <span style="color: #2d9574;">{</span> $<span style="color: #bc6ec5; font-weight: bold;">0</span><span style="color: #67b11d;">(</span>&amp;a<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">}</span> <span style="color: #bc6ec5;">}</span>
          <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li><div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">concat</span>&lt;A: <span style="color: #4f97d7;">AnyObject</span>&gt;<span style="color: #4f97d7;">(</span>
            _ fs: <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>A<span style="color: #2d9574;">)</span> -&gt; A<span style="color: #bc6ec5;">)</span>...
        <span style="color: #4f97d7;">)</span>
        -&gt; <span style="color: #4f97d7;">(</span>A<span style="color: #4f97d7;">)</span> -&gt; A <span style="color: #4f97d7;">{</span>
            <span style="color: #bc6ec5;">{</span> x <span style="color: #4f97d7; font-weight: bold;">in</span>
                <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">reduce</span><span style="color: #2d9574;">(</span>f: <span style="color: #67b11d;">{</span> a, f <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #b1951d;">(</span>a<span style="color: #b1951d;">)</span> <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)(</span>fs<span style="color: #2d9574;">)(</span>x<span style="color: #2d9574;">)</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li><div class="org-src-container">

<pre class="src src-swift">       <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">compose</span>&lt;A, B, C&gt;<span style="color: #4f97d7;">(</span>_ f: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>B<span style="color: #bc6ec5;">)</span>-&gt;C, _ g: <span style="color: #4f97d7; font-weight: bold;">@escaping</span><span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span> -&gt; B<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>A<span style="color: #bc6ec5;">)</span> -&gt; C<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
           <span style="color: #bc6ec5;">{</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">g</span><span style="color: #67b11d;">(</span>a<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> <span style="color: #bc6ec5;">}</span>
       <span style="color: #4f97d7;">}</span>
       
       <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">Dog</span> <span style="color: #4f97d7;">{</span>
           <span style="color: #4f97d7; font-weight: bold;">var</span> favoriteFood: DogFood
       <span style="color: #4f97d7;">}</span>
       
       <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">DogFood</span> <span style="color: #4f97d7;">{</span>
           <span style="color: #4f97d7; font-weight: bold;">var</span> name: <span style="color: #4f97d7;">String</span>
           <span style="color: #4f97d7; font-weight: bold;">var</span> scrumptiousness: <span style="color: #4f97d7;">Int</span>
       <span style="color: #4f97d7;">}</span>
       
       <span style="color: #4f97d7; font-weight: bold;">let</span> doggieBoy: Dog = <span style="color: #bc6ec5; font-weight: bold;">compose</span><span style="color: #4f97d7;">(</span>
         <span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #bc6ec5;">(</span>\Dog.<span style="color: #7590db;">favoriteFood</span><span style="color: #bc6ec5;">)</span>,
          <span style="color: #bc6ec5; font-weight: bold;">prop</span><span style="color: #bc6ec5;">(</span>\DogFood.<span style="color: #7590db;">scrumptiousness</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)(</span><span style="color: #bc6ec5;">{</span>$0+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)(</span>
         <span style="color: #bc6ec5; font-weight: bold;">Dog</span><span style="color: #bc6ec5;">(</span>favoriteFood: <span style="color: #bc6ec5; font-weight: bold;">DogFood</span><span style="color: #2d9574;">(</span>name: <span style="color: #2d9574;">"nuggers"</span>, scrumptiousness: <span style="color: #a45bad;">1999</span><span style="color: #2d9574;">)</span>
       <span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <span class="label label-primary TODO">TODO</span> Tagged</h2>
<div class="outline-text-2" id="text-11">
<p>
We can use `Decodable` and `Encodable` to and from json.
Sometimes it can be desirable to wrap your datatypes with a custom type,
e.g. use an <code>Email</code> struct instead of just <code>String</code>.
This can help avoid errors, because the compiler will complain if you pass other fields to
e.g. a <code>sendEmail</code> function.
</p>

<p>
Problem: If you have a custom struct, you need to adapt the json structure.
Or implement your custom <code>Decodable</code> instance.
Or use <code>RawRepresentable</code> which saves a lot of code.
You will have to tag on an <code>Equatable</code> though:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">Subscription</span>: <span style="color: #4f97d7;">Decodable</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">Id</span>: <span style="color: #4f97d7;">Decodable</span>, <span style="color: #4f97d7;">RawRepresentable</span>, <span style="color: #4f97d7;">Equatable</span> <span style="color: #bc6ec5;">{</span> <span style="color: #4f97d7; font-weight: bold;">let</span> rawValue: <span style="color: #4f97d7;">Int</span> <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">let</span> id: Id
  <span style="color: #4f97d7; font-weight: bold;">let</span> ownerId: <span style="color: #4f97d7;">Int</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
This is really need, but you're gonna repeat the three protocols all over again.
Akin to <code>newtype</code> in haskell we can use <code>Tagged&lt;Tag, Type&gt;</code>:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">Subscription</span>: <span style="color: #4f97d7;">Decodable</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">typealias</span> Id = Tagged&lt;Subscription, <span style="color: #4f97d7;">Int</span>&gt;

  <span style="color: #4f97d7; font-weight: bold;">let</span> id: Id
  <span style="color: #4f97d7; font-weight: bold;">let</span> ownerId: User.<span style="color: #7590db;">Id</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
Tagged uses <i>Conditional conformance</i> to implement <code>Equatable</code> and <code>Decodable</code>:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">Tagged</span>: <span style="color: #4f97d7;">Equatable</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">RawValue</span>: <span style="color: #4f97d7;">Equatable</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> == <span style="color: #bc6ec5;">(</span>lhs: Tagged, rhs: Tagged<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> lhs.<span style="color: #4f97d7;">rawValue</span> == rhs.<span style="color: #4f97d7;">rawValue</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
If you have to instantiate <code>Tagged</code> fields yourself, it makes sense to use
<code>ExpressibleBy...Literal</code> protocols.
</p>
</div>
