org/reading-notes/functional-programming/pointfree.org
** Exercises
   1. Expressible by string:
      #+BEGIN_SRC swift
        extension Tagged: ExpressibleByUnicodeScalarLiteral where RawValue: ExpressibleByStringLiteral {
            typealias UnicodeScalarLiteralType = String
        }
        
        extension Tagged: ExpressibleByExtendedGraphemeClusterLiteral where RawValue: ExpressibleByStringLiteral {
            init(extendedGraphemeClusterLiteral value: String) {
                self.init(stringLiteral: value as! RawValue.StringLiteralType)
            }
        }
        
        extension Tagged: ExpressibleByStringLiteral where RawValue: ExpressibleByStringLiteral {
            init(stringLiteral value: RawValue.StringLiteralType) {
                self.init(rawValue: RawValue(stringLiteral: value))
            }
        }
      #+END_SRC
   2. 
       #+BEGIN_SRC swift
         extension Tagged: Comparable where RawValue: Comparable {
             static func < (lhs: Tagged<Tag, RawValue>, rhs: Tagged<Tag, RawValue>) -> Bool {
                 return lhs.rawValue < rhs.rawValue
             }
         }
         // from swift-overture:
         public func their<Root, Value: Comparable>(
             _ getter: @escaping (Root) -> Value
         )
         -> (Root, Root) -> Bool {
             return their(getter, <)
         }
        
        
         users.sorted(by: their(\.id))
       #+END_SRC
   3. hmmmmm
      #+BEGIN_SRC swift
         enum AgeTag {}
         typealias Age = Tagged<AgeTag, Int>
      #+END_SRC
   4. 


* TODO Dependency Injection made easy
Protocol oriented programming for DI is the most common way in swift.
They come with a lot of boilerplate.
Another solution is to use staticly defined environments that you can swap out at test time:
#+BEGIN_SRC swift
struct Environment {
  var analytics = Analytics()
  var date: () -> Date = Date.init
  var gitHub = GitHub()
}

var Current = Environment()
#+END_SRC

The test setup then looks somewhat like this:

#+BEGIN_SRC swift
  // Define mock dependencies statically
  extension GitHub {
    let static mock = GitHub(fetchRepos: { callback in
      callback(.success([
        GitHub.Repo(
          archived: false,
          description: "Blob's blog",
          htmlUrl: URL("https://www.pointfree.co",
          name: "Bloblog",
          pushedAt: Date(timeIntervalSinceReferenceData: 547152021)
        )
      ])
    })
  }
  
  extension Environment {
      static let mock = Environment(
        analytics: .mock,
        date: { Date(timeIntervalSinceReferenceDate: 557152051) },
        gitHub: .mock
      )
  }
Current = .mock
// Do tests
#+END_SRC
Unfortunately no example of some clean test suite is provided.
Downsides: it will keep you from parallelizing tests,
and won't force you to overwrite dependencies with mocks during tests.
** TODO Exercises


