reading-notes/functional-programming/pointfree.html

<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Exercises</h3>
<div class="outline-text-3" id="text-11-1">
<ol class="org-ol">
<li>Expressible by string:
<div class="org-src-container">

<pre class="src src-swift">        <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">Tagged</span>: <span style="color: #4f97d7;">ExpressibleByUnicodeScalarLiteral</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">RawValue</span>: <span style="color: #4f97d7;">ExpressibleByStringLiteral</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">typealias</span> <span style="color: #4f97d7;">UnicodeScalarLiteralType</span> = <span style="color: #4f97d7;">String</span>
        <span style="color: #4f97d7;">}</span>
        
        <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">Tagged</span>: <span style="color: #4f97d7;">ExpressibleByExtendedGraphemeClusterLiteral</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">RawValue</span>: <span style="color: #4f97d7;">ExpressibleByStringLiteral</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #bc6ec5;">(</span>extendedGraphemeClusterLiteral value: <span style="color: #4f97d7;">String</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #2d9574;">(</span>stringLiteral: value <span style="color: #4f97d7; font-weight: bold;">as</span>! <span style="color: #4f97d7;">RawValue</span>.<span style="color: #4f97d7;">StringLiteralType</span><span style="color: #2d9574;">)</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
        
        <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">Tagged</span>: <span style="color: #4f97d7;">ExpressibleByStringLiteral</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">RawValue</span>: <span style="color: #4f97d7;">ExpressibleByStringLiteral</span> <span style="color: #4f97d7;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #bc6ec5;">(</span>stringLiteral value: <span style="color: #4f97d7;">RawValue</span>.<span style="color: #4f97d7;">StringLiteralType</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #2d9574;">(</span>rawValue: <span style="color: #4f97d7;">RawValue</span><span style="color: #67b11d;">(</span>stringLiteral: value<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">}</span>
</pre>
</div>
</li>
<li><div class="org-src-container">

<pre class="src src-swift">         <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">Tagged</span>: <span style="color: #4f97d7;">Comparable</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">RawValue</span>: <span style="color: #4f97d7;">Comparable</span> <span style="color: #4f97d7;">{</span>
             <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> &lt; <span style="color: #bc6ec5;">(</span>lhs: Tagged&lt;Tag, <span style="color: #4f97d7;">RawValue</span>&gt;, rhs: Tagged&lt;Tag, <span style="color: #4f97d7;">RawValue</span>&gt;<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #bc6ec5;">{</span>
                 <span style="color: #4f97d7; font-weight: bold;">return</span> lhs.<span style="color: #4f97d7;">rawValue</span> &lt; rhs.<span style="color: #4f97d7;">rawValue</span>
             <span style="color: #bc6ec5;">}</span>
         <span style="color: #4f97d7;">}</span>
         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">from swift-overture:</span>
         <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">their</span>&lt;Root, <span style="color: #4f97d7;">Value</span>: <span style="color: #4f97d7;">Comparable</span>&gt;<span style="color: #4f97d7;">(</span>
             _ getter: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span>Root<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Value</span>
         <span style="color: #4f97d7;">)</span>
         -&gt; <span style="color: #4f97d7;">(</span>Root, Root<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #4f97d7;">{</span>
             <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">their</span><span style="color: #bc6ec5;">(</span>getter, &lt;<span style="color: #bc6ec5;">)</span>
         <span style="color: #4f97d7;">}</span>
        
        
         users.<span style="color: #4f97d7;">sorted</span><span style="color: #4f97d7;">(</span>by: <span style="color: #bc6ec5; font-weight: bold;">their</span><span style="color: #bc6ec5;">(</span>\.<span style="color: #7590db;">id</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</li>
<li>hmmmmm
<div class="org-src-container">

<pre class="src src-swift">         <span style="color: #4f97d7; font-weight: bold;">enum</span> <span style="color: #bc6ec5; font-weight: bold;">AgeTag</span> <span style="color: #4f97d7;">{}</span>
         <span style="color: #4f97d7; font-weight: bold;">typealias</span> Age = Tagged&lt;AgeTag, <span style="color: #4f97d7;">Int</span>&gt;
</pre>
</div>
</li>
<li></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <span class="label label-primary TODO">TODO</span> Dependency Injection made easy</h2>
<div class="outline-text-2" id="text-12">
<p>
Protocol oriented programming for DI is the most common way in swift.
They come with a lot of boilerplate.
Another solution is to use staticly defined environments that you can swap out at test time:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">Environment</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">var</span> analytics = <span style="color: #bc6ec5; font-weight: bold;">Analytics</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7; font-weight: bold;">var</span> date: <span style="color: #bc6ec5;">()</span> -&gt; <span style="color: #4f97d7;">Date</span> = <span style="color: #4f97d7;">Date</span>.<span style="color: #4f97d7; font-weight: bold;">init</span>
  <span style="color: #4f97d7; font-weight: bold;">var</span> gitHub = <span style="color: #bc6ec5; font-weight: bold;">GitHub</span><span style="color: #bc6ec5;">()</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">var</span> Current = <span style="color: #bc6ec5; font-weight: bold;">Environment</span><span style="color: #4f97d7;">()</span>
</pre>
</div>

<p>
The test setup then looks somewhat like this:
</p>

<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Define mock dependencies statically</span>
  <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">GitHub</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7; font-weight: bold;">static</span> mock = <span style="color: #bc6ec5; font-weight: bold;">GitHub</span><span style="color: #bc6ec5;">(</span>fetchRepos: <span style="color: #2d9574;">{</span> callback <span style="color: #4f97d7; font-weight: bold;">in</span>
      <span style="color: #bc6ec5; font-weight: bold;">callback</span><span style="color: #67b11d;">(</span>.<span style="color: #4f97d7;">success</span><span style="color: #b1951d;">(</span><span style="color: #4f97d7;">[</span>
        GitHub.<span style="color: #bc6ec5; font-weight: bold;">Repo</span><span style="color: #bc6ec5;">(</span>
          archived: <span style="color: #a45bad;">false</span>,
          description: <span style="color: #2d9574;">"Blob's blog"</span>,
          htmlUrl: <span style="color: #4f97d7;">URL</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"https://www.pointfree.co"</span>,
          name: <span style="color: #2d9574;">"Bloblog"</span>,
          pushedAt: <span style="color: #4f97d7;">Date</span><span style="color: #9cb6ad;">(</span>timeIntervalSinceReferenceData: <span style="color: #a45bad;">547152021</span><span style="color: #9cb6ad;">)</span>
        <span style="color: #2d9574;">)</span>
      <span style="color: #e0211d; text-decoration: overline;">])</span>
    <span style="color: #e0211d; text-decoration: overline;">}</span><span style="color: #67b11d;">)</span>
  <span style="color: #2d9574;">}</span>
  
  <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">Environment</span> <span style="color: #2d9574;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">let</span> mock = <span style="color: #bc6ec5; font-weight: bold;">Environment</span><span style="color: #67b11d;">(</span>
        analytics: .<span style="color: #7590db;">mock</span>,
        date: <span style="color: #b1951d;">{</span> <span style="color: #4f97d7;">Date</span><span style="color: #4f97d7;">(</span>timeIntervalSinceReferenceDate: <span style="color: #a45bad;">557152051</span><span style="color: #4f97d7;">)</span> <span style="color: #b1951d;">}</span>,
        gitHub: .<span style="color: #7590db;">mock</span>
      <span style="color: #67b11d;">)</span>
  <span style="color: #2d9574;">}</span>
Current = .<span style="color: #7590db;">mock</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Do tests</span>
</pre>
</div>
<p>
Unfortunately no example of some clean test suite is provided.
Downsides: it will keep you from parallelizing tests,
and won't force you to overwrite dependencies with mocks during tests.
</p>
</div>
