org/reading-notes/functional-programming/pointfree.org
* Dependency Injection Made Comfortable
Nothing much new other than how to easily build mock structures with overture
#+BEGIN_SRC swift
  extension Array where Element == GitHub.Repo {
    static let mock = [
      GitHub.Repo.mock,
      with(.mock, concat(
        set(\.name, "Nomadic Blob"),
        set(\.description, "Where in the world is Blob?"),
        set(\GitHub.Repo.pushedAt, .mock - 60*60*24*2)
      ))
    ]
    static func mocks(_ count: Int) -> Array {
    return (1...count).map { n in
      with(.mock, concat(
        over(\.name) { "#\(n): \($0)" },
        set(\GitHub.Repo.pushedAt, .mock - 60*60*24*TimeInterval(n))
      ))
    }
  }
  }
#+END_SRC
** Exercises
   No exercises


* Playground Driven Development
When developing in UIKit, you can build something similar to previews with playgrounds.
This requires you to modularize your app, or put the whole app in one framework/package.

#+BEGIN_SRC swift
import PointFreeFramework
import PlaygroundSupport

let vc = EpisodeListViewController()
PlaygroundPage.current.liveView = vc
#+END_SRC

* Dependency Injection Made Composable


  
* A Tour of the Composable Architecture: Part 1
  - Cohesive package to solve some problems that Swift UI has
  - Opinionated
  - Focus on modularization and composability
  - Very restrictive regarding side effects.
  - Assertion helper to test the composable architecture, that forces you to deal with all effects
  - Debugging capabilities (.debug to print all actions)
  - Range of example projects

  /Why view store?/
  - Hide state of sub-views so that the current view is only re-rendered when it's own state changes
  - More flexibility binding different front-ends to the state (platform-specific)

  Equatable for duplicate filtering
  Bindings
  For a list of states, there is a lot of index juggling in bare-metal CA
* A Tour of the Composable Architecture: Part 2
  We can get rid of index juggling with ~ForEachStore~
  On the reducer side we need to call forEach that supplies
  - Writable key path to a random access collection of subview-states
  - Case path of an action that embeds an index and action into a subview-action
    (could write this yourself with ~embed~ and ~extract~, but CasePaths supplies the backslash for this)
  - Function to create the environment. Or key path

  Strong type level guarantees

  ForEachStore can be used with stores that only knows about the collection, and the indexed actions.
  This is done with ~scope~, that extracts the list out of the state, and embeds an index action into the global actions.
  (/Extract global state into local, and embed local state into global/)

  Then extracting the subviews into their seperate views, the code becomes very short:
  #+BEGIN_SRC swift
    ForEachStore(
                  self.store.scope(
                      state: \.tiles,
                      action: MyActions.tileAction),
                  content: TileView.init)
  #+END_SRC
  ~combine~ multiple stores, if the global store also needs to handle some logic, that is unrelated to the list of subviews.
