reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> <span class="label label-primary TODO">TODO</span> Exercises</h3>
</div>
</div>


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Dependency Injection Made Comfortable</h2>
<div class="outline-text-2" id="text-13">
<p>
Nothing much new other than how to easily build mock structures with overture
</p>
<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #4f97d7;">Array</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">Element</span> == GitHub.<span style="color: #7590db;">Repo</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">let</span> mock = <span style="color: #bc6ec5;">[</span>
      GitHub.<span style="color: #7590db;">Repo</span>.<span style="color: #7590db;">mock</span>,
      <span style="color: #bc6ec5; font-weight: bold;">with</span><span style="color: #2d9574;">(</span>.<span style="color: #7590db;">mock</span>, <span style="color: #bc6ec5; font-weight: bold;">concat</span><span style="color: #67b11d;">(</span>
        <span style="color: #4f97d7; font-weight: bold;">set</span><span style="color: #b1951d;">(</span>\.<span style="color: #4f97d7;">name</span>, <span style="color: #2d9574;">"Nomadic Blob"</span><span style="color: #b1951d;">)</span>,
        <span style="color: #4f97d7; font-weight: bold;">set</span><span style="color: #b1951d;">(</span>\.<span style="color: #4f97d7;">description</span>, <span style="color: #2d9574;">"Where in the world is Blob?"</span><span style="color: #b1951d;">)</span>,
        <span style="color: #4f97d7; font-weight: bold;">set</span><span style="color: #b1951d;">(</span>\GitHub.<span style="color: #7590db;">Repo</span>.<span style="color: #7590db;">pushedAt</span>, .<span style="color: #7590db;">mock</span> - <span style="color: #a45bad;">60</span>*<span style="color: #a45bad;">60</span>*<span style="color: #a45bad;">24</span>*<span style="color: #a45bad;">2</span><span style="color: #b1951d;">)</span>
      <span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">mocks</span><span style="color: #bc6ec5;">(</span>_ count: <span style="color: #4f97d7;">Int</span><span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Array</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span>...<span style="color: #4f97d7;">count</span><span style="color: #2d9574;">)</span>.<span style="color: #4f97d7;">map</span> <span style="color: #2d9574;">{</span> n <span style="color: #4f97d7; font-weight: bold;">in</span>
      <span style="color: #bc6ec5; font-weight: bold;">with</span><span style="color: #67b11d;">(</span>.<span style="color: #7590db;">mock</span>, <span style="color: #bc6ec5; font-weight: bold;">concat</span><span style="color: #b1951d;">(</span>
        <span style="color: #bc6ec5; font-weight: bold;">over</span><span style="color: #4f97d7;">(</span>\.<span style="color: #4f97d7;">name</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span> <span style="color: #2d9574;">"#\(</span>n<span style="color: #2d9574;">): \(</span>$0<span style="color: #2d9574;">)"</span> <span style="color: #4f97d7;">}</span>,
        <span style="color: #4f97d7; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>\GitHub.<span style="color: #7590db;">Repo</span>.<span style="color: #7590db;">pushedAt</span>, .<span style="color: #7590db;">mock</span> - <span style="color: #a45bad;">60</span>*<span style="color: #a45bad;">60</span>*<span style="color: #a45bad;">24</span>*<span style="color: #4f97d7;">TimeInterval</span><span style="color: #bc6ec5;">(</span>n<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
      <span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
<div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Exercises</h3>
<div class="outline-text-3" id="text-13-1">
<p>
No exercises
</p>
</div>
</div>
</div>


<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Playground Driven Development</h2>
<div class="outline-text-2" id="text-14">
<p>
When developing in UIKit, you can build something similar to previews with playgrounds.
This requires you to modularize your app, or put the whole app in one framework/package.
</p>

<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">import</span> PointFreeFramework
<span style="color: #4f97d7; font-weight: bold;">import</span> PlaygroundSupport

<span style="color: #4f97d7; font-weight: bold;">let</span> vc = <span style="color: #bc6ec5; font-weight: bold;">EpisodeListViewController</span><span style="color: #4f97d7;">()</span>
PlaygroundPage.<span style="color: #4f97d7;">current</span>.<span style="color: #7590db;">liveView</span> = vc
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Dependency Injection Made Composable</h2>
</div>



<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> A Tour of the Composable Architecture: Part 1</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>Cohesive package to solve some problems that Swift UI has
</li>
<li>Opinionated
</li>
<li>Focus on modularization and composability
</li>
<li>Very restrictive regarding side effects.
</li>
<li>Assertion helper to test the composable architecture, that forces you to deal with all effects
</li>
<li>Debugging capabilities (.debug to print all actions)
</li>
<li>Range of example projects
</li>
</ul>

<p>
<i>Why view store?</i>
</p>
<ul class="org-ul">
<li>Hide state of sub-views so that the current view is only re-rendered when it's own state changes
</li>
<li>More flexibility binding different front-ends to the state (platform-specific)
</li>
</ul>

<p>
Equatable for duplicate filtering
Bindings
For a list of states, there is a lot of index juggling in bare-metal CA
</p>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> A Tour of the Composable Architecture: Part 2</h2>
<div class="outline-text-2" id="text-17">
<p>
We can get rid of index juggling with <code>ForEachStore</code>
On the reducer side we need to call forEach that supplies
</p>
<ul class="org-ul">
<li>Writable key path to a random access collection of subview-states
</li>
<li>Case path of an action that embeds an index and action into a subview-action
(could write this yourself with <code>embed</code> and <code>extract</code>, but CasePaths supplies the backslash for this)
</li>
<li>Function to create the environment. Or key path
</li>
</ul>

<p>
Strong type level guarantees
</p>

<p>
ForEachStore can be used with stores that only knows about the collection, and the indexed actions.
This is done with <code>scope</code>, that extracts the list out of the state, and embeds an index action into the global actions.
(<i>Extract global state into local, and embed local state into global</i>)
</p>

<p>
Then extracting the subviews into their seperate views, the code becomes very short:
</p>
<div class="org-src-container">

<pre class="src src-swift">    <span style="color: #bc6ec5; font-weight: bold;">ForEachStore</span><span style="color: #4f97d7;">(</span>
                  <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">store</span>.<span style="color: #bc6ec5; font-weight: bold;">scope</span><span style="color: #bc6ec5;">(</span>
                      state: \.<span style="color: #7590db;">tiles</span>,
                      action: MyActions.<span style="color: #7590db;">tileAction</span><span style="color: #bc6ec5;">)</span>,
                  content: TileView.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
<code>combine</code> multiple stores, if the global store also needs to handle some logic, that is unrelated to the list of subviews.
</p>
</div>
</div>
