org/reading-notes/functional-programming/pointfree.org
* A Tour of the Composable Architecture: Part 3
  Exhaustive tests with ~TestStore~.
  _Basic workflow:_
  1. Create a TestStore
     #+BEGIN_SRC swift
       let store = TestStore(
         initialState: AppState(
           todos: [
             Todo(
               description: "Milk",
               id: UUID(uuidString: "00000000-0000-0000-0000-000000000000")!,
               isComplete: false
             )
           ]
         ),
         reducer: appReducer,
         environment: AppEnvironment()
       )
     #+END_SRC
  2. Create exhaustive assertions (effects that are not tested will throw an error)
     #+BEGIN_SRC swift
       store.assert(
       .send(.todo(index: 0, action: .checkboxTapped)) {
         $0.todos = [
           Todo(
             description: "Eggs",
             id: UUID(uuidString: "00000000-0000-0000-0000-000000000001")!,
             isComplete: false
           ),
           Todo(
             description: "Milk",
             id: UUID(uuidString: "00000000-0000-0000-0000-000000000000")!,
             isComplete: true
           )
         ]
       }
       )
     #+END_SRC
  Some more wisdom:
  - Inject dependencies via environment
  - Be explicit in the assertions
  - use an inline struct to define your cancellable id's:
    #+BEGIN_SRC swift
      case .todo(index: _, action: .checkboxTapped):
      struct CancelDelayId: Hashable {}
      
      return Effect(value: .todoDelayCompleted)
        .delay(for: 1, scheduler: environment.mainQueue)
        .eraseToEffect()
        .cancellable(id: CancelDelayId(), cancelInFlight: true)
    #+END_SRC
* A Tour of the Composable Architecture: Part 4
  How to test async effects?
  Test helper will complain if some effects are still running.
  - don't use ~XCTWaiter~ and the like
  - Inject DispatchQueue using ~AnySchedulerOf<DispatchQueue>~ and use ~TestScheduler~ in the tests.
    You can then just ~advance~ your scheduler and don't have to wait.


* Designing Dependenciecs: The problem
This episode introduces the already common approach of abstracting away dependencies
via a protocol. It then builds the case for scrapping the protocol.
(No exercises)
* Designing Dependencies: Modularization
Dependencies can now easily split into modules, and we can even seperate implementation and interface if needed.
(No exercises)
* Designing Dependencies: Reachability
Discusses how to modularise and style a wrapper library around a system API (~NWPathMonitor~).
(No exercises)
* Designing Dependencies: Core Location
Interesting showcase with a more complicated dependency including delegates and ~NSObject~ inheritance.
Keeping a reference to the delegate after the initializer function exits is done via ~receiveEvents~

#+BEGIN_SRC swift
var delegate: Delegate? = Delegate(subject: subject)
locationManager.delegate = delegate
return Self(
  delegate: delegate
    .handleEvents(receiveCancel: { delegate = nil }
    .eraseToAnyPublisher()
  ...
)
#+END_SRC
* Designing Dependencies: The point
This episode demonstrates how freely you can now play with your dependencies.
With this approach you can
- write tests with strong guarantees, e.g. that certain
API's are not called.
- Create transformations/setters on dependencies
- Create decorations on dependencies, such as "every effect is delayed by 1 second"
- Create a mix of dependencies, such as a live core location client that
  only has the final location result hardcoded
- Write a debug screen that arbitrarily taps into your environment

* Redacted SwiftUI: The problem
The problem is that it's hard to seperate concerns in vanilla swiftui.
When you redact a view you don't want any interaction to happen,
hence you basically want to swap out your business logic with no-ops.
In a traditional swiftui setup, you'd have to sprinkle your code all over with early exits to achieve that.
* Redacted SwiftUI: The Composable Architecture
The idea is simple: In CA, Just swap in a Store that has some placeholder data, no reducer and no environment while loading.
You can use the ~.empty~ extension of Reducer for a reducer that doesn't care about any actions.
And a ~void~ env because that's not gonna be used anyway.
* The Point of Redacted SwiftUI: Part 1
- If you have a subview that you ~unredact~ within your bigger view,
you can selectively add back some logic into your empty reducer
- You cann call out to another reducer like this:
#+BEGIN_SRC swift
appReducer.run(&state, &action, &environment)
#+END_SRC
