reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> A Tour of the Composable Architecture: Part 3</h2>
<div class="outline-text-2" id="text-18">
<p>
Exhaustive tests with <code>TestStore</code>.
<span class="underline">Basic workflow:</span>
</p>
<ol class="org-ol">
<li>Create a TestStore
<div class="org-src-container">

<pre class="src src-swift">       <span style="color: #4f97d7; font-weight: bold;">let</span> store = <span style="color: #bc6ec5; font-weight: bold;">TestStore</span><span style="color: #4f97d7;">(</span>
         initialState: <span style="color: #bc6ec5; font-weight: bold;">AppState</span><span style="color: #bc6ec5;">(</span>
           todos: <span style="color: #2d9574;">[</span>
             <span style="color: #bc6ec5; font-weight: bold;">Todo</span><span style="color: #67b11d;">(</span>
               description: <span style="color: #2d9574;">"Milk"</span>,
               id: <span style="color: #4f97d7;">UUID</span><span style="color: #b1951d;">(</span>uuidString: <span style="color: #2d9574;">"00000000-0000-0000-0000-000000000000"</span><span style="color: #b1951d;">)</span>!,
               isComplete: <span style="color: #a45bad;">false</span>
             <span style="color: #67b11d;">)</span>
           <span style="color: #2d9574;">]</span>
         <span style="color: #bc6ec5;">)</span>,
         reducer: appReducer,
         environment: <span style="color: #bc6ec5; font-weight: bold;">AppEnvironment</span><span style="color: #bc6ec5;">()</span>
       <span style="color: #4f97d7;">)</span>
</pre>
</div>
</li>
<li>Create exhaustive assertions (effects that are not tested will throw an error)
<div class="org-src-container">

<pre class="src src-swift">       store.<span style="color: #4f97d7;">assert</span><span style="color: #4f97d7;">(</span>
       .<span style="color: #4f97d7;">send</span><span style="color: #bc6ec5;">(</span>.<span style="color: #bc6ec5; font-weight: bold;">todo</span><span style="color: #2d9574;">(</span>index: <span style="color: #a45bad;">0</span>, action: .<span style="color: #7590db;">checkboxTapped</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
         $0.<span style="color: #7590db;">todos</span> = <span style="color: #2d9574;">[</span>
           <span style="color: #bc6ec5; font-weight: bold;">Todo</span><span style="color: #67b11d;">(</span>
             description: <span style="color: #2d9574;">"Eggs"</span>,
             id: <span style="color: #4f97d7;">UUID</span><span style="color: #b1951d;">(</span>uuidString: <span style="color: #2d9574;">"00000000-0000-0000-0000-000000000001"</span><span style="color: #b1951d;">)</span>!,
             isComplete: <span style="color: #a45bad;">false</span>
           <span style="color: #67b11d;">)</span>,
           <span style="color: #bc6ec5; font-weight: bold;">Todo</span><span style="color: #67b11d;">(</span>
             description: <span style="color: #2d9574;">"Milk"</span>,
             id: <span style="color: #4f97d7;">UUID</span><span style="color: #b1951d;">(</span>uuidString: <span style="color: #2d9574;">"00000000-0000-0000-0000-000000000000"</span><span style="color: #b1951d;">)</span>!,
             isComplete: <span style="color: #a45bad;">true</span>
           <span style="color: #67b11d;">)</span>
         <span style="color: #2d9574;">]</span>
       <span style="color: #bc6ec5;">}</span>
       <span style="color: #4f97d7;">)</span>
</pre>
</div>
</li>
</ol>
<p>
Some more wisdom:
</p>
<ul class="org-ul">
<li>Inject dependencies via environment
</li>
<li>Be explicit in the assertions
</li>
<li>use an inline struct to define your cancellable id's:
<div class="org-src-container">

<pre class="src src-swift">      <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #bc6ec5; font-weight: bold;">todo</span><span style="color: #4f97d7;">(</span>index: _, action: .<span style="color: #7590db;">checkboxTapped</span><span style="color: #4f97d7;">)</span>:
      <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">CancelDelayId</span>: <span style="color: #4f97d7;">Hashable</span> <span style="color: #4f97d7;">{}</span>
      
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">Effect</span><span style="color: #4f97d7;">(</span>value: .<span style="color: #7590db;">todoDelayCompleted</span><span style="color: #4f97d7;">)</span>
        .<span style="color: #4f97d7;">delay</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">for</span>: <span style="color: #a45bad;">1</span>, scheduler: environment.<span style="color: #7590db;">mainQueue</span><span style="color: #4f97d7;">)</span>
        .<span style="color: #bc6ec5; font-weight: bold;">eraseToEffect</span><span style="color: #4f97d7;">()</span>
        .<span style="color: #bc6ec5; font-weight: bold;">cancellable</span><span style="color: #4f97d7;">(</span>id: <span style="color: #bc6ec5; font-weight: bold;">CancelDelayId</span><span style="color: #bc6ec5;">()</span>, cancelInFlight: <span style="color: #a45bad;">true</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> A Tour of the Composable Architecture: Part 4</h2>
<div class="outline-text-2" id="text-19">
<p>
How to test async effects?
Test helper will complain if some effects are still running.
</p>
<ul class="org-ul">
<li>don't use <code>XCTWaiter</code> and the like
</li>
<li>Inject DispatchQueue using <code>AnySchedulerOf&lt;DispatchQueue&gt;</code> and use <code>TestScheduler</code> in the tests.
You can then just <code>advance</code> your scheduler and don't have to wait.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Designing Dependenciecs: The problem</h2>
<div class="outline-text-2" id="text-20">
<p>
This episode introduces the already common approach of abstracting away dependencies
via a protocol. It then builds the case for scrapping the protocol.
(No exercises)
</p>
</div>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Designing Dependencies: Modularization</h2>
<div class="outline-text-2" id="text-21">
<p>
Dependencies can now easily split into modules, and we can even seperate implementation and interface if needed.
(No exercises)
</p>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Designing Dependencies: Reachability</h2>
<div class="outline-text-2" id="text-22">
<p>
Discusses how to modularise and style a wrapper library around a system API (<code>NWPathMonitor</code>).
(No exercises)
</p>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Designing Dependencies: Core Location</h2>
<div class="outline-text-2" id="text-23">
<p>
Interesting showcase with a more complicated dependency including delegates and <code>NSObject</code> inheritance.
Keeping a reference to the delegate after the initializer function exits is done via <code>receiveEvents</code>
</p>

<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">var</span> delegate: Delegate? = <span style="color: #bc6ec5; font-weight: bold;">Delegate</span><span style="color: #4f97d7;">(</span>subject: subject<span style="color: #4f97d7;">)</span>
locationManager.<span style="color: #4f97d7;">delegate</span> = delegate
<span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">Self</span><span style="color: #4f97d7;">(</span>
  delegate: delegate
    .<span style="color: #4f97d7;">handleEvents</span><span style="color: #bc6ec5;">(</span>receiveCancel: <span style="color: #2d9574;">{</span> delegate = <span style="color: #a45bad;">nil</span> <span style="color: #2d9574;">}</span>
    .<span style="color: #4f97d7;">eraseToAnyPublisher</span><span style="color: #2d9574;">()</span>
  ...
<span style="color: #bc6ec5;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Designing Dependencies: The point</h2>
<div class="outline-text-2" id="text-24">
<p>
This episode demonstrates how freely you can now play with your dependencies.
With this approach you can
</p>
<ul class="org-ul">
<li>write tests with strong guarantees, e.g. that certain
</li>
</ul>
<p>
API's are not called.
</p>
<ul class="org-ul">
<li>Create transformations/setters on dependencies
</li>
<li>Create decorations on dependencies, such as "every effect is delayed by 1 second"
</li>
<li>Create a mix of dependencies, such as a live core location client that
only has the final location result hardcoded
</li>
<li>Write a debug screen that arbitrarily taps into your environment
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Redacted SwiftUI: The problem</h2>
<div class="outline-text-2" id="text-25">
<p>
The problem is that it's hard to seperate concerns in vanilla swiftui.
When you redact a view you don't want any interaction to happen,
hence you basically want to swap out your business logic with no-ops.
In a traditional swiftui setup, you'd have to sprinkle your code all over with early exits to achieve that.
</p>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Redacted SwiftUI: The Composable Architecture</h2>
<div class="outline-text-2" id="text-26">
<p>
The idea is simple: In CA, Just swap in a Store that has some placeholder data, no reducer and no environment while loading.
You can use the <code>.empty</code> extension of Reducer for a reducer that doesn't care about any actions.
And a <code>void</code> env because that's not gonna be used anyway.
</p>
</div>
</div>
<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> The Point of Redacted SwiftUI: Part 1</h2>
<div class="outline-text-2" id="text-27">
<ul class="org-ul">
<li>If you have a subview that you <code>unredact</code> within your bigger view,
</li>
</ul>
<p>
you can selectively add back some logic into your empty reducer
</p>
<ul class="org-ul">
<li>You cann call out to another reducer like this
</li>
</ul>
<div class="org-src-container">

<pre class="src src-swift">appReducer.<span style="color: #4f97d7;">run</span><span style="color: #4f97d7;">(</span>&amp;state, &amp;action, &amp;environment<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
