org/reading-notes/functional-programming/pointfree.org
** Exercises
   1. My solution:
#+BEGIN_SRC swift
    func applying<T: View, I: View>(view: I, @ViewBuilder block: (I) -> T) -> T {
        block(view)
    }
#+END_SRC
      The reference solution uses an extension:
#+BEGIN_SRC swift
extension View {
  func applying<V: View>(
    @ViewBuilder _ builder: @escaping (Self) -> V
  ) -> some View {
    builder(self)
  }
}
#+END_SRC
   2, 3 & 4:
   For this we need to migrate the onboarding view to the composable architecture as well.
   we can then react on actions happening in the "subview" (the app):
   #+BEGIN_SRC swift
     case .placeholderAction(.todo(let id, action: .checkBoxToggled)):
         guard state.step == .todos else { return .none }
         state.placeholderState.todos[id: id]?.isComplete.toggle()
         return .none
   #+END_SRC
   
* The Point of Redacted SwiftUI: Part 2
   This shows the reference solutions of part 1: You can do it more elegant with ~case let where~, and run the original app reducer:
   #+BEGIN_SRC swift
case let .placeholderAction(action) where state.step == .todos:
    switch action {
    case .todo(id: _, action: .checkBoxToggled),
         .sortCompletedTodos:
        return appReducer
          .run(&state.placeholderState, action, environment)
          .map(OnboardingAction.placeholderAction)
   #+END_SRC

* Concise Forms: SwiftUI
- SwiftUI ~Form~ arrangement is a great way to build simple forms
- Split sections with ~Section~
- State handling and side effects quickly become messy with vanilla SwiftUI
  (guess who saves the day, the composable architecture of course)
* Concise Forms: Composable Architecture
This episode mainly showcases basic TCA stuff, and how it makes state mutations in forms more readable and testable,
albeit being a bit more verbose.
** Exercises
1. Simple test, just a state change. We can also make sure to error in any dependencies now unused (registerPush for example).
#+BEGIN_SRC swift
store.assert(
            .send(.notificationSettingsResponse(UserNotificationsClient.Settings.init(authorizationStatus: .denied))) {
                $0.sendNotifications = false
                $0.alert = .init(title: "You need to enable permissions from iOS settings")
            }
        )
#+END_SRC
(The reference solution tested a different user flow rather than the individual ~Action~ of a denied response).
2. 
#+BEGIN_SRC swift
store.assert(
            .send(.sendNotificationsChanged(true)),
            .receive(.notificationSettingsResponse(.init(authorizationStatus: .denied))) {
                $0.sendNotifications = false
                $0.alert = .init(title: "You need to enable permissions from iOS settings")
            }
        )
#+END_SRC
Reference tests dismissing the alert as well.
