reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-27-1" class="outline-3">
<h3 id="sec-27-1"><span class="section-number-3">27.1</span> Exercises</h3>
<div class="outline-text-3" id="text-27-1">
<ol class="org-ol">
<li>My solution:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift">    <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">applying</span>&lt;T: View, I: View&gt;<span style="color: #4f97d7;">(</span>view: I, <span style="color: #4f97d7; font-weight: bold;">@ViewBuilder</span> block: <span style="color: #bc6ec5;">(</span>I<span style="color: #bc6ec5;">)</span> -&gt; T<span style="color: #4f97d7;">)</span> -&gt; T <span style="color: #4f97d7;">{</span>
        <span style="color: #bc6ec5; font-weight: bold;">block</span><span style="color: #bc6ec5;">(</span>view<span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
The reference solution uses an extension:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">View</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">applying</span>&lt;V: View&gt;<span style="color: #bc6ec5;">(</span>
    <span style="color: #4f97d7; font-weight: bold;">@ViewBuilder</span> _ builder: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">Self</span><span style="color: #2d9574;">)</span> -&gt; V
  <span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7; font-weight: bold;">some</span> View <span style="color: #bc6ec5;">{</span>
    <span style="color: #bc6ec5; font-weight: bold;">builder</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
2, 3 &amp; 4:
For this we need to migrate the onboarding view to the composable architecture as well.
we can then react on actions happening in the "subview" (the app):
</p>
<div class="org-src-container">

<pre class="src src-swift">     <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #bc6ec5; font-weight: bold;">placeholderAction</span><span style="color: #4f97d7;">(</span>.<span style="color: #bc6ec5; font-weight: bold;">todo</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> id, action: .<span style="color: #7590db;">checkBoxToggled</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>:
         <span style="color: #4f97d7; font-weight: bold;">guard</span> state.<span style="color: #7590db;">step</span> == .<span style="color: #7590db;">todos</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7;">{</span> <span style="color: #4f97d7; font-weight: bold;">return</span> .<span style="color: #4f97d7; font-weight: bold;">none</span> <span style="color: #4f97d7;">}</span>
         state.<span style="color: #7590db;">placeholderState</span>.<span style="color: #7590db;">todos</span><span style="color: #4f97d7;">[</span>id: id<span style="color: #4f97d7;">]</span>?.<span style="color: #7590db;">isComplete</span>.<span style="color: #4f97d7;">toggle</span><span style="color: #4f97d7;">()</span>
         <span style="color: #4f97d7; font-weight: bold;">return</span> .<span style="color: #4f97d7; font-weight: bold;">none</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> The Point of Redacted SwiftUI: Part 2</h2>
<div class="outline-text-2" id="text-28">
<p>
This shows the reference solutions of part 1: You can do it more elegant with <code>case let where</code>, and run the original app reducer:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #4f97d7; font-weight: bold;">let</span> .<span style="color: #bc6ec5; font-weight: bold;">placeholderAction</span><span style="color: #4f97d7;">(</span>action<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span> state.<span style="color: #7590db;">step</span> == .<span style="color: #7590db;">todos</span>:
    <span style="color: #4f97d7; font-weight: bold;">switch</span> action <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">case</span> .<span style="color: #bc6ec5; font-weight: bold;">todo</span><span style="color: #bc6ec5;">(</span>id: _, action: .<span style="color: #7590db;">checkBoxToggled</span><span style="color: #bc6ec5;">)</span>,
         .<span style="color: #7590db;">sortCompletedTodos</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> appReducer
          .<span style="color: #4f97d7;">run</span><span style="color: #bc6ec5;">(</span>&amp;state.<span style="color: #7590db;">placeholderState</span>, action, environment<span style="color: #bc6ec5;">)</span>
          .<span style="color: #4f97d7;">map</span><span style="color: #bc6ec5;">(</span>OnboardingAction.<span style="color: #7590db;">placeholderAction</span><span style="color: #bc6ec5;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> Concise Forms: SwiftUI</h2>
<div class="outline-text-2" id="text-29">
<ul class="org-ul">
<li>SwiftUI <code>Form</code> arrangement is a great way to build simple forms
</li>
<li>Split sections with <code>Section</code>
</li>
<li>State handling and side effects quickly become messy with vanilla SwiftUI
(guess who saves the day, the composable architecture of course)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> Concise Forms: Composable Architecture</h2>
<div class="outline-text-2" id="text-30">
<p>
This episode mainly showcases basic TCA stuff, and how it makes state mutations in forms more readable and testable,
albeit being a bit more verbose.
</p>
</div>
<div id="outline-container-sec-30-1" class="outline-3">
<h3 id="sec-30-1"><span class="section-number-3">30.1</span> Exercises</h3>
<div class="outline-text-3" id="text-30-1">
<ol class="org-ol">
<li>Simple test, just a state change. We can also make sure to error in any dependencies now unused (registerPush for example).
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift">store.<span style="color: #4f97d7;">assert</span><span style="color: #4f97d7;">(</span>
            .<span style="color: #4f97d7;">send</span><span style="color: #bc6ec5;">(</span>.<span style="color: #bc6ec5; font-weight: bold;">notificationSettingsResponse</span><span style="color: #2d9574;">(</span>UserNotificationsClient.<span style="color: #7590db;">Settings</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #67b11d;">(</span>authorizationStatus: .<span style="color: #7590db;">denied</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
                $0.<span style="color: #7590db;">sendNotifications</span> = <span style="color: #a45bad;">false</span>
                $0.<span style="color: #7590db;">alert</span> = .<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #2d9574;">(</span>title: <span style="color: #2d9574;">"You need to enable permissions from iOS settings"</span><span style="color: #2d9574;">)</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
(The reference solution tested a different user flow rather than the individual <code>Action</code> of a denied response).
</p>
<ol class="org-ol">
<li></li>
</ol>
<div class="org-src-container">

<pre class="src src-swift">store.<span style="color: #4f97d7;">assert</span><span style="color: #4f97d7;">(</span>
            .<span style="color: #4f97d7;">send</span><span style="color: #bc6ec5;">(</span>.<span style="color: #bc6ec5; font-weight: bold;">sendNotificationsChanged</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">true</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>,
            .<span style="color: #4f97d7;">receive</span><span style="color: #bc6ec5;">(</span>.<span style="color: #bc6ec5; font-weight: bold;">notificationSettingsResponse</span><span style="color: #2d9574;">(</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #67b11d;">(</span>authorizationStatus: .<span style="color: #7590db;">denied</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
                $0.<span style="color: #7590db;">sendNotifications</span> = <span style="color: #a45bad;">false</span>
                $0.<span style="color: #7590db;">alert</span> = .<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #2d9574;">(</span>title: <span style="color: #2d9574;">"You need to enable permissions from iOS settings"</span><span style="color: #2d9574;">)</span>
            <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
Reference tests dismissing the alert as well.
</p>
</div>
</div>
</div>
