org/reading-notes/functional-programming/pointfree.org
* Concise Forms: Bye Bye Boilerplate
Forms can be incredibly simpler than the "naive" TCA approach.
1. Wrap form actions (getters and setters of key paths) in a generic struct
#+BEGIN_SRC swift
struct FormAction<Root>: Equatable {
  let keyPath: PartialKeyPath<Root>
  let value: AnyEquatable
  let setter: (inout Root) -> Void

  init<Value>(
    _ keyPath: WritableKeyPath<Root, Value>,
    _ value: Value
  ) where Value: Equatable {
    self.keyPath = keyPath
    self.value = AnyEquatable(value)
    self.setter = { $0[keyPath: keyPath] = value }
  }

  // Note this is just an alias for init, for better readability
  static func set<Value>(
    _ keyPath: WritableKeyPath<Root, Value>,
    _ value: Value
  ) -> Self where Value: Equatable {
    self.init(keyPath, value)
  }

  static func == (lhs: FormAction<Root>, rhs: FormAction<Root>) -> Bool {
    lhs.keyPath == rhs.keyPath && lhs.value == rhs.value
  }
}
#+END_SRC
2. Use a single action for all state changes by form interactions:
#+BEGIN_SRC swift
case form(FormAction<SettingsState>)
#+END_SRC
3. use viewStore.binding with key store to hook the action into the form
   (⚠ This method seems deprecated, more info in Safer, Conciser Forms: Part 1&2)
#+BEGIN_SRC swift

extension ViewStore {
  func binding<Value>(
    keyPath: WritableKeyPath<State, Value>,
    send action: @escaping (FormAction<State>) -> Action
  ) -> Binding<Value> where Value: Hashable {
    self.binding(
      get: { $0[keyPath: keyPath] },
      send: { action(.init(keyPath, $0)) }
    )
  }
}

// And then:
Picker(
              "Top posts digest",
              selection: viewStore.binding(
                keyPath: \.digest,
                send: ConciseSettingsAction.form
              )
...
#+END_SRC
4. Reduce even more boiler plate by allowing switches on the form action on first level:
#+BEGIN_SRC swift
func ~= <Root, Value> (
  keyPath: WritableKeyPath<Root, Value>,
  formAction: FormAction<Root>
) -> Bool {
  formAction.keyPath == keyPath
}
#+END_SRC
neat!
** Exercises:
1. AnyEquatable
#+BEGIN_SRC swift
struct AnyEquatable: Equatable {
    let value: Any
    let equals: ((Any) -> Bool)!
    init<E>(_ base: E) where E : Equatable {
        self.value = base
        self.equals = { $0 as? E == base }
    }
}

func == (lhs: AnyEquatable, rhs: AnyEquatable) -> Bool {
    lhs.equals(rhs.value)
}
#+END_SRC
(almost equal to reference solution).
* Concise Forms: The Point
This presents concise forms in action within isowords.
⚠ In the current version of TCA, the action and higher level reducer have been renamed more generally to
~BindingAction<T>~ and ~.binding()~.
* SwiftUI Animation: The Basics
Implicit animations (~.animation(_,value:)~) vs explicit animations (~withAnimation {}~).
Implicit animations can give great results with very little work but are unsuitable
for fine-grained control, because they animate everything in the view hirarchy.
And the semantics of overriding animations is not clear.
E.g. if/else branches rather than ternary operator can mess up your animation semantics.

~withAnimation~ is a special case of a /continuation/: ~(A -> R) -> R~ (where ~A~ is ~Void~ in this case).
Animate bindings with ~binding.animation()~ instead of ~withAnimation~.
