reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> Concise Forms: Bye Bye Boilerplate</h2>
<div class="outline-text-2" id="text-31">
<p>
Forms can be incredibly simpler than the "naive" TCA approach.
</p>
<ol class="org-ol">
<li>Wrap form actions (getters and setters of key paths) in a generic struct
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">FormAction</span>&lt;Root&gt;: <span style="color: #4f97d7;">Equatable</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">let</span> keyPath: <span style="color: #4f97d7;">PartialKeyPath</span>&lt;Root&gt;
  <span style="color: #4f97d7; font-weight: bold;">let</span> value: AnyEquatable
  <span style="color: #4f97d7; font-weight: bold;">let</span> setter: <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">inout</span> Root<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Void</span>

  <span style="color: #4f97d7; font-weight: bold;">init</span>&lt;<span style="color: #4f97d7;">Value</span>&gt;<span style="color: #bc6ec5;">(</span>
    _ keyPath: <span style="color: #4f97d7;">WritableKeyPath</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;,
    _ value: <span style="color: #4f97d7;">Value</span>
  <span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">Value</span>: <span style="color: #4f97d7;">Equatable</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">keyPath</span> = keyPath
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">value</span> = <span style="color: #bc6ec5; font-weight: bold;">AnyEquatable</span><span style="color: #2d9574;">(</span>value<span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">setter</span> = <span style="color: #2d9574;">{</span> $0<span style="color: #67b11d;">[</span>keyPath: keyPath<span style="color: #67b11d;">]</span> = value <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Note this is just an alias for init, for better readability</span>
  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7; font-weight: bold;">set</span>&lt;<span style="color: #4f97d7;">Value</span>&gt;<span style="color: #bc6ec5;">(</span>
    _ keyPath: <span style="color: #4f97d7;">WritableKeyPath</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;,
    _ value: <span style="color: #4f97d7;">Value</span>
  <span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7; font-weight: bold;">Self</span> <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">Value</span>: <span style="color: #4f97d7;">Equatable</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #2d9574;">(</span>keyPath, value<span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> == <span style="color: #bc6ec5;">(</span>lhs: FormAction&lt;Root&gt;, rhs: FormAction&lt;Root&gt;<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #bc6ec5;">{</span>
    lhs.<span style="color: #4f97d7;">keyPath</span> == rhs.<span style="color: #4f97d7;">keyPath</span> &amp;&amp; lhs.<span style="color: #4f97d7;">value</span> == rhs.<span style="color: #4f97d7;">value</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<ol class="org-ol">
<li>Use a single action for all state changes by form interactions:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #bc6ec5; font-weight: bold;">form</span><span style="color: #4f97d7;">(</span>FormAction&lt;SettingsState&gt;<span style="color: #4f97d7;">)</span>
</pre>
</div>
<ol class="org-ol">
<li>use viewStore.binding with key store to hook the action into the form
(⚠ This method seems deprecated, more info in Safer, Conciser Forms: Part 1&amp;2)
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">ViewStore</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">binding</span>&lt;<span style="color: #4f97d7;">Value</span>&gt;<span style="color: #bc6ec5;">(</span>
    keyPath: <span style="color: #4f97d7;">WritableKeyPath</span>&lt;<span style="color: #4f97d7;">State</span>, <span style="color: #4f97d7;">Value</span>&gt;,
    send action: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span>FormAction&lt;<span style="color: #4f97d7;">State</span>&gt;<span style="color: #2d9574;">)</span> -&gt; Action
  <span style="color: #bc6ec5;">)</span> -&gt; Binding&lt;<span style="color: #4f97d7;">Value</span>&gt; <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">Value</span>: <span style="color: #4f97d7;">Hashable</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #bc6ec5; font-weight: bold;">binding</span><span style="color: #2d9574;">(</span>
      <span style="color: #4f97d7; font-weight: bold;">get</span>: <span style="color: #67b11d;">{</span> $0<span style="color: #b1951d;">[</span>keyPath: keyPath<span style="color: #b1951d;">]</span> <span style="color: #67b11d;">}</span>,
      send: <span style="color: #67b11d;">{</span> <span style="color: #bc6ec5; font-weight: bold;">action</span><span style="color: #b1951d;">(</span>.<span style="color: #4f97d7; font-weight: bold;">init</span><span style="color: #4f97d7;">(</span>keyPath, $0<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">And then:</span>
<span style="color: #bc6ec5; font-weight: bold;">Picker</span><span style="color: #4f97d7;">(</span>
              <span style="color: #2d9574;">"Top posts digest"</span>,
              selection: viewStore.<span style="color: #bc6ec5; font-weight: bold;">binding</span><span style="color: #bc6ec5;">(</span>
                keyPath: \.<span style="color: #7590db;">digest</span>,
                send: ConciseSettingsAction.<span style="color: #7590db;">form</span>
              <span style="color: #bc6ec5;">)</span>
...
</pre>
</div>
<ol class="org-ol">
<li>Reduce even more boiler plate by allowing switches on the form action on first level:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">func</span> ~= &lt;Root, <span style="color: #4f97d7;">Value</span>&gt; <span style="color: #4f97d7;">(</span>
  keyPath: <span style="color: #4f97d7;">WritableKeyPath</span>&lt;Root, <span style="color: #4f97d7;">Value</span>&gt;,
  formAction: FormAction&lt;Root&gt;
<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #4f97d7;">{</span>
  formAction.<span style="color: #4f97d7;">keyPath</span> == keyPath
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
neat!
</p>
</div>
<div id="outline-container-sec-31-1" class="outline-3">
<h3 id="sec-31-1"><span class="section-number-3">31.1</span> Exercises:</h3>
<div class="outline-text-3" id="text-31-1">
<ol class="org-ol">
<li>AnyEquatable
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">AnyEquatable</span>: <span style="color: #4f97d7;">Equatable</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">let</span> value: Any
    <span style="color: #4f97d7; font-weight: bold;">let</span> equals: <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>Any<span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span>!
    <span style="color: #4f97d7; font-weight: bold;">init</span>&lt;E&gt;<span style="color: #bc6ec5;">(</span>_ base: E<span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span> E : <span style="color: #4f97d7;">Equatable</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">value</span> = base
        <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">equals</span> = <span style="color: #2d9574;">{</span> $0 <span style="color: #4f97d7; font-weight: bold;">as</span>? E == base <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> == <span style="color: #4f97d7;">(</span>lhs: AnyEquatable, rhs: AnyEquatable<span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span> <span style="color: #4f97d7;">{</span>
    lhs.<span style="color: #bc6ec5; font-weight: bold;">equals</span><span style="color: #bc6ec5;">(</span>rhs.<span style="color: #4f97d7;">value</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
(almost equal to reference solution).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> Concise Forms: The Point</h2>
<div class="outline-text-2" id="text-32">
<p>
This presents concise forms in action within isowords.
⚠ In the current version of TCA, the action and higher level reducer have been renamed more generally to
<code>BindingAction&lt;T&gt;</code> and <code>.binding()</code>.
</p>
</div>
</div>
<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> SwiftUI Animation: The Basics</h2>
<div class="outline-text-2" id="text-33">
<p>
Implicit animations (<code>.animation(_,value:)</code>) vs explicit animations (<code>withAnimation {}</code>).
Implicit animations can give great results with very little work but are unsuitable
for fine-grained control, because they animate everything in the view hirarchy.
And the semantics of overriding animations is not clear.
E.g. if/else branches rather than ternary operator can mess up your animation semantics.
</p>

<p>
<code>withAnimation</code> is a special case of a <i>continuation</i>: <code>(A -&gt; R) -&gt; R</code> (where <code>A</code> is <code>Void</code> in this case).
Animate bindings with <code>binding.animation()</code> instead of <code>withAnimation</code>.
</p>
</div>
