org/reading-notes/functional-programming/pointfree.org
** Exercises
1. (Might be an ugly solution, don't know the best practices)
   We can create the work on the dispatch queue as ~WorkItem~'s and cancel them later.
#+BEGIN_SRC swift
@State private var animationStack: [DispatchWorkItem] = []
// ...

   Button("Cycle colors") {
        [Color.red, .blue, .green, .purple, .black]
          .enumerated()
          .forEach { offset, color in
              let work = DispatchWorkItem(block: {
                  withAnimation(.linear) {
                      self.viewModel.circleColor = color
                  }
              })
              self.animationStack.append(work)
              DispatchQueue.main.asyncAfter(deadline: .now() + .seconds(offset), execute: work)
          }
 // ...
      Button("Reset") {
          for work in self.animationStack {
              work.cancel()
          }
          animationStack.removeAll()
          // ...
      }
#+END_SRC
2. Easy!
#+BEGIN_SRC swift
class ViewModel: ObservableObject {
    @Published var circleCenter = CGPoint.zero
    @Published var circleColor = Color.black
    @Published var isCircleScaled = false
    @Published var isResetting = false
}
...

struct ContentView: View {
    @StateObject var viewModel: ViewModel
    /// Then change all usages of self.someState to self.viewModel.someState
}
#+END_SRC


* Better Test Dependencies: Exhaustivity
- Make those functions/dependencies fail that are not used in the test,
e.g. by providing an unimplemented helper. For example
#+BEGIN_SRC swift
extension UUID {
  static let unimplemented: () -> UUID = { fatalError() }
}
#+END_SRC
This will assert which dependencies are not used, strengthening your tests.
Also if you add more usage of the dependencies later, the tests will tell you exactly where to update.
- Record function arguments by passing closures like so:
#+BEGIN_SRC swift
extension AnalyticsClient {
  static func test(onEvent: @escaping (Event) -> Void) -> Self {
    Self(
      track: { event in
        .fireAndForget {
          onEvent(event)
        }
      }
    )
  }
}
#+END_SRC
** Exercises
1. An assertion helper that asserts the events and removes all of them
#+BEGIN_SRC swift
  func assertTracked(events: inout [AnalyticsClient.Event]) {
    XCTAssertEqual(events, self.events)
    events.removeAll()
  }
#+END_SRC  
(But why not re-initialise the captured data every time?)
* Better Test Dependencies: Failability
- use ~XCTDynamicTestOverlay~
- create a failing dependency "constructor'
#+BEGIN_SRC swift
static let failing = Self(
        execute: { language in
            XCTFail("MyService.execute(\(language)) not implemented")
            return SomeDummyData()
        }
    )
#+END_SRC
it will not crash the testsuite. CA can also better point out where the error is.
There is a neat failing `Effect` in CA:
~Effect.failing(prefix: String)~




* A Tour of Isowords: Part 1
Describes the hyper-modularization, domain modelling and testing strategy for isowords.
* A Tour of Isowords: Part 2
Demonstrates how the composable architecture can be used
to abstract away seperate features like app clips and app store videos
on top of the existing game logic, without littering it with additional code.


