reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-33-1" class="outline-3">
<h3 id="sec-33-1"><span class="section-number-3">33.1</span> Exercises</h3>
<div class="outline-text-3" id="text-33-1">
<ol class="org-ol">
<li>(Might be an ugly solution, don't know the best practices)
We can create the work on the dispatch queue as <code>WorkItem</code>'s and cancel them later.
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">@State</span> <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">var</span> animationStack: <span style="color: #4f97d7;">[</span>DispatchWorkItem<span style="color: #4f97d7;">]</span> = <span style="color: #4f97d7;">[]</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>

   <span style="color: #bc6ec5; font-weight: bold;">Button</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Cycle colors"</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
        <span style="color: #bc6ec5;">[</span>Color.<span style="color: #7590db;">red</span>, .<span style="color: #7590db;">blue</span>, .<span style="color: #7590db;">green</span>, .<span style="color: #7590db;">purple</span>, .<span style="color: #7590db;">black</span><span style="color: #bc6ec5;">]</span>
          .<span style="color: #4f97d7;">enumerated</span><span style="color: #bc6ec5;">()</span>
          .<span style="color: #4f97d7;">forEach</span> <span style="color: #bc6ec5;">{</span> offset, color <span style="color: #4f97d7; font-weight: bold;">in</span>
              <span style="color: #4f97d7; font-weight: bold;">let</span> work = <span style="color: #bc6ec5; font-weight: bold;">DispatchWorkItem</span><span style="color: #2d9574;">(</span>block: <span style="color: #67b11d;">{</span>
                  <span style="color: #bc6ec5; font-weight: bold;">withAnimation</span><span style="color: #b1951d;">(</span>.<span style="color: #7590db;">linear</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                      <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">viewModel</span>.<span style="color: #7590db;">circleColor</span> = color
                  <span style="color: #b1951d;">}</span>
              <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>
              <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">animationStack</span>.<span style="color: #4f97d7;">append</span><span style="color: #2d9574;">(</span>work<span style="color: #2d9574;">)</span>
              DispatchQueue.<span style="color: #4f97d7;">main</span>.<span style="color: #bc6ec5; font-weight: bold;">asyncAfter</span><span style="color: #2d9574;">(</span>deadline: .<span style="color: #4f97d7;">now</span><span style="color: #67b11d;">()</span> + .<span style="color: #4f97d7;">seconds</span><span style="color: #67b11d;">(</span>offset<span style="color: #67b11d;">)</span>, execute: work<span style="color: #2d9574;">)</span>
          <span style="color: #bc6ec5;">}</span>
 <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
      <span style="color: #bc6ec5; font-weight: bold;">Button</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Reset"</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">for</span> work <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">animationStack</span> <span style="color: #2d9574;">{</span>
              work.<span style="color: #4f97d7;">cancel</span><span style="color: #67b11d;">()</span>
          <span style="color: #2d9574;">}</span>
          animationStack.<span style="color: #4f97d7;">removeAll</span><span style="color: #2d9574;">()</span>
          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
      <span style="color: #bc6ec5;">}</span>
</pre>
</div>
<ol class="org-ol">
<li>Easy!
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #bc6ec5; font-weight: bold;">ViewModel</span>: <span style="color: #4f97d7;">ObservableObject</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">@Published</span> <span style="color: #4f97d7; font-weight: bold;">var</span> circleCenter = CGPoint.<span style="color: #4f97d7;">zero</span>
    <span style="color: #4f97d7; font-weight: bold;">@Published</span> <span style="color: #4f97d7; font-weight: bold;">var</span> circleColor = Color.<span style="color: #7590db;">black</span>
    <span style="color: #4f97d7; font-weight: bold;">@Published</span> <span style="color: #4f97d7; font-weight: bold;">var</span> isCircleScaled = <span style="color: #a45bad;">false</span>
    <span style="color: #4f97d7; font-weight: bold;">@Published</span> <span style="color: #4f97d7; font-weight: bold;">var</span> isResetting = <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
...

<span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">ContentView</span>: View <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">@StateObject</span> <span style="color: #4f97d7; font-weight: bold;">var</span> viewModel: ViewModel
    <span style="color: #2aa1ae; background-color: #292e34;">/// </span><span style="color: #2aa1ae; background-color: #292e34;">Then change all usages of self.someState to self.viewModel.someState</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> Better Test Dependencies: Exhaustivity</h2>
<div class="outline-text-2" id="text-34">
<ul class="org-ul">
<li>Make those functions/dependencies fail that are not used in the test,
</li>
</ul>
<p>
e.g. by providing an unimplemented helper. For example
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #4f97d7;">UUID</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">let</span> unimplemented: <span style="color: #bc6ec5;">()</span> -&gt; <span style="color: #4f97d7;">UUID</span> = <span style="color: #bc6ec5;">{</span> <span style="color: #4f97d7;">fatalError</span><span style="color: #2d9574;">()</span> <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
This will assert which dependencies are not used, strengthening your tests.
Also if you add more usage of the dependencies later, the tests will tell you exactly where to update.
</p>
<ul class="org-ul">
<li>Record function arguments by passing closures like so:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">AnalyticsClient</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">test</span><span style="color: #bc6ec5;">(</span>onEvent: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">Event</span><span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Void</span><span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7; font-weight: bold;">Self</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">Self</span><span style="color: #2d9574;">(</span>
      track: <span style="color: #67b11d;">{</span> event <span style="color: #4f97d7; font-weight: bold;">in</span>
        .<span style="color: #7590db;">fireAndForget</span> <span style="color: #b1951d;">{</span>
          <span style="color: #bc6ec5; font-weight: bold;">onEvent</span><span style="color: #4f97d7;">(</span>event<span style="color: #4f97d7;">)</span>
        <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
<div id="outline-container-sec-34-1" class="outline-3">
<h3 id="sec-34-1"><span class="section-number-3">34.1</span> Exercises</h3>
<div class="outline-text-3" id="text-34-1">
<ol class="org-ol">
<li>An assertion helper that asserts the events and removes all of them
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift">  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">assertTracked</span><span style="color: #4f97d7;">(</span>events: <span style="color: #4f97d7; font-weight: bold;">inout</span> <span style="color: #bc6ec5;">[</span>AnalyticsClient.<span style="color: #4f97d7;">Event</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #bc6ec5; font-weight: bold;">XCTAssertEqual</span><span style="color: #bc6ec5;">(</span>events, <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">events</span><span style="color: #bc6ec5;">)</span>
    events.<span style="color: #4f97d7;">removeAll</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
(But why not re-initialise the captured data every time?)
</p>
</div>
</div>
</div>
<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> Better Test Dependencies: Failability</h2>
<div class="outline-text-2" id="text-35">
<ul class="org-ul">
<li>use <code>XCTDynamicTestOverlay</code>
</li>
<li>create a failing dependency "constructor'
</li>
</ul>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">let</span> failing = <span style="color: #4f97d7; font-weight: bold;">Self</span><span style="color: #4f97d7;">(</span>
        execute: <span style="color: #bc6ec5;">{</span> language <span style="color: #4f97d7; font-weight: bold;">in</span>
            <span style="color: #bc6ec5; font-weight: bold;">XCTFail</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"MyService.execute(\(</span>language<span style="color: #2d9574;">)) not implemented"</span><span style="color: #2d9574;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">SomeDummyData</span><span style="color: #2d9574;">()</span>
        <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
it will not crash the testsuite. CA can also better point out where the error is.
There is a neat failing `Effect` in CA:
<code>Effect.failing(prefix: String)</code>
</p>
</div>
</div>




<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> A Tour of Isowords: Part 1</h2>
<div class="outline-text-2" id="text-36">
<p>
Describes the hyper-modularization, domain modelling and testing strategy for isowords.
</p>
</div>
</div>
<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> A Tour of Isowords: Part 2</h2>
<div class="outline-text-2" id="text-37">
<p>
Demonstrates how the composable architecture can be used
to abstract away seperate features like app clips and app store videos
on top of the existing game logic, without littering it with additional code.
</p>
</div>
</div>
