org/reading-notes/functional-programming/pointfree.org
* Async Refreshable: SwiftUI
You can use ~.refreshable { <async closure> }~ to implement a simple pull to refresh.
We could use for example the new async URLSession to perform the data refresh,
since refreshable gives us an async context.
#+BEGIN_SRC swift
let (data, _) = try await URLSession.shared.data(...)
#+END_SRC
If we want to be able to cancle such asnychronous work, it needs to be wrapped in a task:
#+BEGIN_SRC swift
let task = Task {
  //...perform work
}
task.cancel()
#+END_SRC
If this task is part of your ~ObservableObject~ view model and you want to display state based
on weather the task is running or not, you had to mark it as ~@Published~, so that
SwiftUI can recompute the view when the State of ~Task~ execution changes.

When performing ~async~ things that then modify some state on completion, it can make sense
to use ~@MainAction~ method annotation, to make sure work is resumed on the main thread, after finishing 
the async workload.

The episode then goes to explain that e.g. displaying loading state and cancelling requests when doing ~async~ tasks
is hard to test. For example, it seems you have to work with ~TaskSleep~ and artificial delays to hook into the state of the view model
where the request is currently executing.

* Async Refreshable: ComposableArchitecture
When the ~refreshable~ closure is called, the loading spinner is shown as long as an async task is running
in the asynchronous context of it. This is a problem with the composable architecture: While you of course can make changes
to the store from an async context, the call to make these changes returns immediately.

Solution: Use a boolean to reflect weather an async process is running
#+BEGIN_SRC swift
func send(
  _ action: Action,
  `while` isInFlight: @escaping (State) -> Bool
) async {
    self.send(action)
    await withUnsafeContinuation { continuation in
        var cancellable: Cancellable?
        cancellable = self.publisher
          .filter { !isInFlight($0) }
          .prefix(1)
          .sink { _ in
              continuation.resume(returning: ())
              _ = cancellable
          }
    }
}
#+END_SRC
