reading-notes/functional-programming/pointfree.html


<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> Async Refreshable: SwiftUI</h2>
<div class="outline-text-2" id="text-38">
<p>
You can use <code>.refreshable { &lt;async closure&gt; }</code> to implement a simple pull to refresh.
We could use for example the new async URLSession to perform the data refresh,
since refreshable gives us an async context.
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7;">(</span>data, _<span style="color: #4f97d7;">)</span> = <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #4f97d7; font-weight: bold;">await</span> <span style="color: #4f97d7;">URLSession</span>.<span style="color: #4f97d7;">shared</span>.<span style="color: #4f97d7;">data</span><span style="color: #4f97d7;">(</span>...<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
If we want to be able to cancle such asnychronous work, it needs to be wrapped in a task:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">let</span> task = Task <span style="color: #4f97d7;">{</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">...perform work</span>
<span style="color: #4f97d7;">}</span>
task.<span style="color: #4f97d7;">cancel</span><span style="color: #4f97d7;">()</span>
</pre>
</div>
<p>
If this task is part of your <code>ObservableObject</code> view model and you want to display state based
on weather the task is running or not, you had to mark it as <code>@Published</code>, so that
SwiftUI can recompute the view when the State of <code>Task</code> execution changes.
</p>

<p>
When performing <code>async</code> things that then modify some state on completion, it can make sense
to use <code>@MainAction</code> method annotation, to make sure work is resumed on the main thread, after finishing 
the async workload.
</p>

<p>
The episode then goes to explain that e.g. displaying loading state and cancelling requests when doing <code>async</code> tasks
is hard to test. For example, it seems you have to work with <code>TaskSleep</code> and artificial delays to hook into the state of the view model
where the request is currently executing.
</p>
</div>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> Async Refreshable: ComposableArchitecture</h2>
<div class="outline-text-2" id="text-39">
<p>
When the <code>refreshable</code> closure is called, the loading spinner is shown as long as an async task is running
in the asynchronous context of it. This is a problem with the composable architecture: While you of course can make changes
to the store from an async context, the call to make these changes returns immediately.
</p>

<p>
Solution: Use a boolean to reflect weather an async process is running
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">send</span><span style="color: #4f97d7;">(</span>
  _ action: Action,
  <span style="color: #2d9574;">`while`</span> isInFlight: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">State</span><span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span>
<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">async</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">send</span><span style="color: #bc6ec5;">(</span>action<span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">await</span> withUnsafeContinuation <span style="color: #bc6ec5;">{</span> continuation <span style="color: #4f97d7; font-weight: bold;">in</span>
        <span style="color: #4f97d7; font-weight: bold;">var</span> cancellable: Cancellable?
        cancellable = <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">publisher</span>
          .<span style="color: #4f97d7;">filter</span> <span style="color: #2d9574;">{</span> <span style="color: #a45bad;">!</span><span style="color: #bc6ec5; font-weight: bold;">isInFlight</span><span style="color: #67b11d;">(</span>$0<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">}</span>
          .<span style="color: #4f97d7; font-weight: bold;">prefix</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>
          .<span style="color: #4f97d7;">sink</span> <span style="color: #2d9574;">{</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span>
              continuation.<span style="color: #4f97d7;">resume</span><span style="color: #67b11d;">(</span>returning: <span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>
              _ = cancellable
          <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
