org/reading-notes/functional-programming/pointfree.org
** Exercises
1. My solution, probably with some race conditions:
#+BEGIN_SRC swift

extension ViewStore {
  func send(
    _ action: Action,
    while predicate: @escaping (State) -> Bool
  ) async {
    self.send(action)
      var cancellable: Cancellable?
      let onCancel = { cancellable = nil }
      await withTaskCancellationHandler(operation: {
          await withUnsafeContinuation { (continuation: UnsafeContinuation<Void, Never>) in
              cancellable = self.publisher
                  .filter { !predicate($0) }
                  .prefix(1)
                  .sink { _ in
                      continuation.resume()
                      _ = cancellable
                  }
          }
      }, onCancel: { onCancel() })
  }
}

#+END_SRC
Reference solution:
#+BEGIN_SRC swift
extension ViewStore {
  func send(
    _ action: Action,
    `while` isInFlight: @escaping (State) -> Bool
  ) async {
    self.send(action)

    var cancellable: Cancellable?
    try? await withTaskCancellationHandler(
      handler: { [cancellable] in cancellable?.cancel() },
      operation: {
        try Task.checkCancellation()
        try await withUnsafeThrowingContinuation { (continuation: UnsafeContinuation<Void, Error>) in
          guard !Task.isCancelled else {
            continuation.resume(throwing: CancellationError())
            return
          }
          cancellable = self.publisher
            .filter { !predicate($0) }
            .prefix(1)
            .sink { _ in
              continuation.resume()
              _ = cancellable
            }
        }
      }
    )
  }
}
#+END_SRC
(In my solution i don't check for cancellation)
Also i'm not sure how the capture list works. Won't it capture always ~nil~, so the cancelable will actually never be cancelled?
2. I don't think we can write it in terms of the previous function, because we cannot ~await~ in ~withAnimation~ block.
My monke brain solution would be to copy the previous function and wrap the ~store.send~ inside a ~withAnimation(animation){}~.
Reference solution: Extract the code after ~store.send~ and use it in both functions.
3. From what we learned so far, this should be quite easy:
#+BEGIN_SRC swift
extension ViewStore {
    var stream: AsyncStream<State> {
        return AsyncStream { continuation in
            var cancellable: Cancellable?
            cancellable = self.publisher
                .sink { newState in
                    continuation.yield(newState)
                }
            continuation.onTermination = {  @Sendable [cancellable] _ in
                cancellable?.cancel()
            }
        }
    }
}
#+END_SRC
The reference solution doesn't mind about the ~onTermination~, and handles completions by calling ~continuation.finish()~.
4. This is much shorter now with ~stream~:
#+BEGIN_SRC swift
extension ViewStore {
    func suspend(while predicate: @escaping (State) -> Bool) async {
        let stream = self.stream
        .filter { !predicate($0) }
        .prefix(1)
        for try await _ in stream { }
    }
}
#+END_SRC
It can be more elegant without the weird for loop:
#+BEGIN_SRC swift
extension ViewStore {
  func suspend(while predicate: @escaping (State) -> Bool) async {
    _ = await self.stream
      .filter { !predicate($0) }
      .first(where: { _ in true })
  }
}
#+END_SRC

