reading-notes/functional-programming/pointfree.html
<div id="outline-container-sec-39-1" class="outline-3">
<h3 id="sec-39-1"><span class="section-number-3">39.1</span> Exercises</h3>
<div class="outline-text-3" id="text-39-1">
<ol class="org-ol">
<li>My solution, probably with some race conditions:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">ViewStore</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">send</span><span style="color: #bc6ec5;">(</span>
    _ action: Action,
    <span style="color: #4f97d7; font-weight: bold;">while</span> predicate: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">State</span><span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span>
  <span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">async</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">send</span><span style="color: #2d9574;">(</span>action<span style="color: #2d9574;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">var</span> cancellable: Cancellable?
      <span style="color: #4f97d7; font-weight: bold;">let</span> onCancel = <span style="color: #2d9574;">{</span> cancellable = <span style="color: #a45bad;">nil</span> <span style="color: #2d9574;">}</span>
      <span style="color: #4f97d7; font-weight: bold;">await</span> <span style="color: #bc6ec5; font-weight: bold;">withTaskCancellationHandler</span><span style="color: #2d9574;">(</span>operation: <span style="color: #67b11d;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">await</span> withUnsafeContinuation <span style="color: #b1951d;">{</span> <span style="color: #4f97d7;">(</span>continuation: UnsafeContinuation&lt;<span style="color: #4f97d7;">Void</span>, <span style="color: #4f97d7;">Never</span>&gt;<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">in</span>
              cancellable = <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">publisher</span>
                  .<span style="color: #4f97d7;">filter</span> <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">!</span><span style="color: #bc6ec5; font-weight: bold;">predicate</span><span style="color: #bc6ec5;">(</span>$0<span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7;">}</span>
                  .<span style="color: #4f97d7; font-weight: bold;">prefix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
                  .<span style="color: #4f97d7;">sink</span> <span style="color: #4f97d7;">{</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span>
                      continuation.<span style="color: #4f97d7;">resume</span><span style="color: #bc6ec5;">()</span>
                      _ = cancellable
                  <span style="color: #4f97d7;">}</span>
          <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>, onCancel: <span style="color: #67b11d;">{</span> <span style="color: #bc6ec5; font-weight: bold;">onCancel</span><span style="color: #b1951d;">()</span> <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

</pre>
</div>
<p>
Reference solution:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">ViewStore</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">send</span><span style="color: #bc6ec5;">(</span>
    _ action: Action,
    <span style="color: #2d9574;">`while`</span> isInFlight: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">State</span><span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span>
  <span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">async</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">send</span><span style="color: #2d9574;">(</span>action<span style="color: #2d9574;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">var</span> cancellable: Cancellable?
    <span style="color: #4f97d7; font-weight: bold;">try</span>? <span style="color: #4f97d7; font-weight: bold;">await</span> <span style="color: #bc6ec5; font-weight: bold;">withTaskCancellationHandler</span><span style="color: #2d9574;">(</span>
      handler: <span style="color: #67b11d;">{</span> <span style="color: #b1951d;">[</span>cancellable<span style="color: #b1951d;">]</span> <span style="color: #4f97d7; font-weight: bold;">in</span> cancellable?.<span style="color: #4f97d7;">cancel</span><span style="color: #b1951d;">()</span> <span style="color: #67b11d;">}</span>,
      operation: <span style="color: #67b11d;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">try</span> Task.<span style="color: #bc6ec5; font-weight: bold;">checkCancellation</span><span style="color: #b1951d;">()</span>
        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #4f97d7; font-weight: bold;">await</span> withUnsafeThrowingContinuation <span style="color: #b1951d;">{</span> <span style="color: #4f97d7;">(</span>continuation: UnsafeContinuation&lt;<span style="color: #4f97d7;">Void</span>, <span style="color: #4f97d7;">Error</span>&gt;<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">in</span>
          <span style="color: #4f97d7; font-weight: bold;">guard</span> <span style="color: #a45bad;">!</span>Task.<span style="color: #4f97d7;">isCancelled</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7;">{</span>
            continuation.<span style="color: #4f97d7;">resume</span><span style="color: #bc6ec5;">(</span>throwing: <span style="color: #bc6ec5; font-weight: bold;">CancellationError</span><span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">return</span>
          <span style="color: #4f97d7;">}</span>
          cancellable = <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">publisher</span>
            .<span style="color: #4f97d7;">filter</span> <span style="color: #4f97d7;">{</span> <span style="color: #a45bad;">!</span><span style="color: #bc6ec5; font-weight: bold;">predicate</span><span style="color: #bc6ec5;">(</span>$0<span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7;">}</span>
            .<span style="color: #4f97d7; font-weight: bold;">prefix</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
            .<span style="color: #4f97d7;">sink</span> <span style="color: #4f97d7;">{</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span>
              continuation.<span style="color: #4f97d7;">resume</span><span style="color: #bc6ec5;">()</span>
              _ = cancellable
            <span style="color: #4f97d7;">}</span>
        <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
(In my solution i don't check for cancellation)
Also i'm not sure how the capture list works. Won't it capture always <code>nil</code>, so the cancelable will actually never be cancelled?
</p>
<ol class="org-ol">
<li>I don't think we can write it in terms of the previous function, because we cannot <code>await</code> in <code>withAnimation</code> block.
</li>
</ol>
<p>
My monke brain solution would be to copy the previous function and wrap the <code>store.send</code> inside a <code>withAnimation(animation){}</code>.
Reference solution: Extract the code after <code>store.send</code> and use it in both functions.
</p>
<ol class="org-ol">
<li>From what we learned so far, this should be quite easy:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">ViewStore</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> stream: AsyncStream&lt;<span style="color: #4f97d7;">State</span>&gt; <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> AsyncStream <span style="color: #2d9574;">{</span> continuation <span style="color: #4f97d7; font-weight: bold;">in</span>
            <span style="color: #4f97d7; font-weight: bold;">var</span> cancellable: Cancellable?
            cancellable = <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #4f97d7;">publisher</span>
                .<span style="color: #4f97d7;">sink</span> <span style="color: #67b11d;">{</span> newState <span style="color: #4f97d7; font-weight: bold;">in</span>
                    continuation.<span style="color: #bc6ec5; font-weight: bold;">yield</span><span style="color: #b1951d;">(</span>newState<span style="color: #b1951d;">)</span>
                <span style="color: #67b11d;">}</span>
            continuation.<span style="color: #7590db;">onTermination</span> = <span style="color: #67b11d;">{</span>  <span style="color: #4f97d7; font-weight: bold;">@Sendable</span> <span style="color: #b1951d;">[</span>cancellable<span style="color: #b1951d;">]</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span>
                cancellable?.<span style="color: #4f97d7;">cancel</span><span style="color: #b1951d;">()</span>
            <span style="color: #67b11d;">}</span>
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
The reference solution doesn't mind about the <code>onTermination</code>, and handles completions by calling <code>continuation.finish()</code>.
</p>
<ol class="org-ol">
<li>This is much shorter now with <code>stream</code>:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">ViewStore</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">suspend</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> predicate: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">State</span><span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">async</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">let</span> stream = <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">stream</span>
        .<span style="color: #4f97d7;">filter</span> <span style="color: #2d9574;">{</span> <span style="color: #a45bad;">!</span><span style="color: #bc6ec5; font-weight: bold;">predicate</span><span style="color: #67b11d;">(</span>$0<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">}</span>
        .<span style="color: #4f97d7; font-weight: bold;">prefix</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #4f97d7; font-weight: bold;">await</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> stream <span style="color: #2d9574;">{</span> <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
It can be more elegant without the weird for loop:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">extension</span> <span style="color: #bc6ec5; font-weight: bold;">ViewStore</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">suspend</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> predicate: <span style="color: #4f97d7; font-weight: bold;">@escaping</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7;">State</span><span style="color: #2d9574;">)</span> -&gt; <span style="color: #4f97d7;">Bool</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">async</span> <span style="color: #bc6ec5;">{</span>
    _ = <span style="color: #4f97d7; font-weight: bold;">await</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">stream</span>
      .<span style="color: #4f97d7;">filter</span> <span style="color: #2d9574;">{</span> <span style="color: #a45bad;">!</span><span style="color: #bc6ec5; font-weight: bold;">predicate</span><span style="color: #67b11d;">(</span>$0<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">}</span>
      .<span style="color: #4f97d7;">first</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">where</span>: <span style="color: #67b11d;">{</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
