reading-notes/functional-programming/pointfree.html

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> Safer, Conciser Forms: Part 1</h2>
<div class="outline-text-2" id="text-40">
<ul class="org-ul">
<li>use <code>@BindableState</code> in your TCA state property to opt-in to make it bindable
</li>
<li>This makes the domain logic safer because the view cannot arbitrarily mutate the state
</li>
<li>use <code>case binding(BindingAction&lt;SpellingChallengeState&gt;)</code> to handle binding actions
</li>
</ul>

<p>
some swift learnings:
</p>
<ul class="org-ul">
<li>Implement <code>projectedValue</code> to expose the wrapping type when writing your own property wrapper.
</li>
</ul>
<p>
Then access the wrapping type with a <code>$</code> prefix. By default, the wrapping type is just exposed
privately and accessed by a <code>_</code> prefix.
</p>
<ul class="org-ul">
<li>Implement getter and setters within <code>projectedValue</code> to derive writable key paths.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> Safer, Conciser Forms: Part 2</h2>
<div class="outline-text-2" id="text-41">
<p>
We can omit stating the binding action case when we derive bindings from bindable state,
or when we chain the higher level <code>.binding(Action)</code> reducer.
Swift enums can conform to protocols with cases, like so:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">protocol</span> <span style="color: #bc6ec5; font-weight: bold;">BindableAction</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">associatedtype</span> <span style="color: #4f97d7;">State</span>
  <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">binding</span><span style="color: #bc6ec5;">(</span>_: BindingAction&lt;<span style="color: #4f97d7;">State</span>&gt;<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #4f97d7; font-weight: bold;">Self</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
You could even simplify creating bindings by implementing a <a href="https://www.hackingwithswift.com/articles/55/how-to-use-dynamic-member-lookup-in-swift">dynamic member lookup</a> for the view store.
This has been deprecated in TCA though, because it causes some problems in the reducer.
If we did't care about the type safety (Only Bindable states can be bound to) we theoretically could use 
this new syntax that allows bindings to be passed to closures:
</p>
<div class="org-src-container">

<pre class="src src-swift"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5; font-weight: bold;">MyView</span>: View <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">@State</span> <span style="color: #4f97d7; font-weight: bold;">var</span> array = <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">]</span>
  <span style="color: #4f97d7; font-weight: bold;">var</span> body: <span style="color: #4f97d7; font-weight: bold;">some</span> View <span style="color: #bc6ec5;">{</span>
    <span style="color: #bc6ec5; font-weight: bold;">ForEach</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.$array, id: \.<span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span> $number <span style="color: #4f97d7; font-weight: bold;">in</span>
      <span style="color: #4f97d7; font-weight: bold;">let</span> _ = $number <span style="color: #4f97d7; font-weight: bold;">as</span> Binding&lt;<span style="color: #4f97d7;">Int</span>&gt;
      <span style="color: #4f97d7; font-weight: bold;">let</span> _ = number <span style="color: #4f97d7; font-weight: bold;">as</span> <span style="color: #4f97d7;">Int</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span> 
</pre>
</div>
</div>
</div>
</div></div></div>
</body>
</html>